gdgly/NUC97X_JS/STM32F4xx/DL698/RM_TASK.cpp

#include "Project698.h"
#include "../DL698/DL698_DataDef.h"
#include "../DL698/TASK.h"
#include "../DL698/RM_TASK.h"
#include "../DL698/RM_RxDATA.h"
#include "../DL698/RM_Record.h"
#include "../DL698/EVENT_Record.h"

#include "../Device/MEMRW.h"
#include "../STM32F4xx/STM32F4xx_UART.h"
#include "../MS/MS.h"
#include "../Calculate/Calculate.h"
#include "../Display/Warning.h"
#include "../Terminal698/Terminal_Init.h"
#include "../DL698/DL698TEST.h"
#include "../DL698/Info_3762.h"

#include "../DL698/DL698_JSON.h"


/*
#define ADDR_6034     ADDR_6032+LENmax_6032//采集任务监控集
//0 采集任务监控单元∷=structure
//{
//2 任务ID       unsigned
//4 任务执行状态  enum
//{
//	未执行（0）
//	执行中（1）
//	已执行（2）
//}，
//6 任务执行开始时间   date_time_s，//用各端口时间值小的
//14 任务执行结束时间   date_time_s，//用各端口时间值大的
//22 采集总数量         long-unsigned，
//25 采集成功数量       long-unsigned，
//28 已发送报文条数     long-unsigned，
//31 已接收报文条数     long-unsigned
//}
//说明：采集成功数量、已发送报文条数、已接收报文条数，每次任务执行先清零。
#define LENper_6034     34
#define NUMmax_6034     NUMmax_6012_2
#define LENmax_6034     (LENper_6034*NUMmax_6034)
*/


//TaskID=b31-b28优先级,b27-b24方案类型,b23-b20采集类型,b19-b16存储时标类型,b15-b8任务号,b7-b0方案编号
//优先级:1=首要,2=必要,3=需要,4=可能
//方案类型:1=普通采集方案,2=事件采集方案,3=透明方案,4=上报方案,5=脚本方案,扩展14=终端事件(不上报),15=终端事件(上报)
//普通采集方案的采集类型:0=采集当前数据,1=采集上第N次,2=按冻结时标采集,3=按时标间隔采集
//普通采集方案的存储时标:0=未定义,1=任务开始时间,2=相对当日0点0分,3=相对上日23点59分,4=相对上日0点0分,5=相对当月1日0点0分,6=数据冻结时标,7=相对上月月末23点59分





u32 RM_Addr(u32 PORTn,u16* pAddr)//指针指向的通信地址是否已抄;返回:0=没抄,1=已抄
{
	u32 i;
	u32 Addr0;
	u32 Addr1;
	u32 Addr2;
	RMokfailLIST_TypeDef *rmOKFAILlist;
	UARTCtrl_TypeDef *UARTCtrl;
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	i=UARTCtrl->TaskID;
	i>>=8;
	i&=0xff;
	if(i>=(RMTASKmax+ExtRMTASKmax))
	{
		return 0;//返回:0=没抄,1=已抄
	}
	rmOKFAILlist=UARTCtrl->rmOKFAILlist[i];
	i=UARTCtrl->NUMrmOK[i];//各任务已采集完成电能表总数
	if(i>NUM_RMmax)
	{
		i=NUM_RMmax;
	}
	Addr0=pAddr[0];
	Addr1=pAddr[1];
	Addr2=pAddr[2];
	while(i--)
	{
		if(Addr0==rmOKFAILlist->Addr0)
		{
			if(Addr1==rmOKFAILlist->Addr1)
			{
				if(Addr2==rmOKFAILlist->Addr2)
				{
					return 1;//返回:0=没抄,1=已抄
				}
			}
		}
		rmOKFAILlist++;
	}
	return 0;
}

u32 RM_MeterCount(u32 PORTn)//电能表计数+1;返回:0=正常,1=任务错
{
	u32 i;
	u32 Nmax;
	u32 id;
	UARTCtrl_TypeDef *UARTCtrl;
	u16* p16Data;
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	UARTCtrl->CONNECT=0;//DL698电能表连接:0-100连接过程序,100=连接,101=
	p16Data=(u16 *)Get_ADDR_UARTnFnDataBuff(PORTn);
	p16Data[3]=0;//长度=时标+已采集的CSD
	p16Data+=LEN_RM_DI_CSD/2;
	p16Data[0]=0;//长度=已填写入buff但还没完整一个CSD的长度(不包括本身2字节)
	p16Data[1]=0;//长度=已填写入buff完整CSD的长度(不包括本身2字节)
	
	id=UARTCtrl->TaskID;
	if(id==0)
	{
		return 1;//返回:0=正常,1=任务错
	}
	id>>=8;
	id&=0xff;
	if(id>=(RMTASKmax+ExtRMTASKmax))
	{
		return 1;//返回:0=正常,1=任务错
	}
#if RM_HPLC_Concurrency==1//0=否,1=是;宽带载波集中器主动并发抄表
	if(PORTn==RS485_4PORT)
	{
		if(Terminal_Router->RouterRunMode_1==2)//路由运行模式_通信方式：1表示"窄带电力线载波通信"，2表示"宽带电力线载波通信"，3表示"微功率无线通信"，其它取值保留
		{//是宽带
			//UARTCtrl->MeterCount[id]=UARTCtrl->SourMeterCount_id;//并发处理时当前任务id的原始抄表电能表计数
		}
	}
#endif
	i=UARTCtrl->MeterCount[id];//各任务已抄电能表计数
	i++;
	UARTCtrl->MeterCount[id]=i;
	
	Nmax=NUM_RMmax;
	switch(id)
	{
		case RMTASKnoPOWER://停上电事件固定任务号
			Nmax=PowerEvent->NUMrm;//停上电事件需抄读电表个数
			if(Nmax>NUM_RMmax)
			{
				Nmax=NUM_RMmax;
			}
			if(i>=Nmax)
			{
				i=UARTCtrl->RMLOOP[id];
				if(i!=0xff)
				{//RMTASKmax byte 全部表抄读一遍的遍数计数
					i++;
					UARTCtrl->RMLOOP[id]=i;
				}
			}
			break;
	}
	if(i>=Nmax)
	{
		UARTCtrl->MeterCount[id]=0;//各任务已抄电能表计数
//		i=UARTCtrl->TaskTime[id].StdTimeCount;//每到频率点标准时间计数+1,每执行一次-1
//		if(i)
//		{
//			i--;
//			UARTCtrl->TaskTime[id].StdTimeCount=i;
//		}
	}
#if RM_HPLC_Concurrency==1//0=否,1=是;宽带载波集中器主动并发抄表
	if(PORTn==RS485_4PORT)
	{
		if(Terminal_Router->RouterRunMode_1==2)//路由运行模式_通信方式：1表示"窄带电力线载波通信"，2表示"宽带电力线载波通信"，3表示"微功率无线通信"，其它取值保留
		{//是宽带
			UARTCtrl->SourMeterCount_id=UARTCtrl->MeterCount[id];//并发处理时当前任务id的原始抄表电能表计数
		}
	}
#endif
	return 0;//返回:0=正常,1=任务错
}


u16* MeterSetNoToCollectorAddr(u32 MeterSetNo)//取采集档案配置序号的采集器地址;入口:从0开始的序号;返回:采集器地址指针,0=无效
{
	u8* p8;
	
	p8=(u8*)ADDR_6000_SDRAM+(MeterSetNo*LENper_6000);
	p8=Get_Element(p8,3,0,0);//计算元素地址,使用ADDR_128KDATABUFF
	if(p8==0)
	{
		return 0;
	}
	return (u16*)(p8+3);
}

void NUMrm(u32 PORTn)//抄表数;出口:任务需抄数，完成数，非法完成数,读记录文件中已完成的地址表
{
	u32 TaskID;
	u32 i;
	u32 x;
	u32 y;
	u32 n;
	u32 id;
	u32 OADPORTn;
	u32 NUMrm;
	u32 filename;
	u8* pMS;
	u8 *p8s;
	u8* p8d;
	UARTCtrl_TypeDef *UARTCtrl;
	ms_Type *ms;
	msFILE_TypeDef *file;
	RecordFileHead_TypeDef* RecordFileHead;//抄表记录文件头
	RMokfailLIST_TypeDef *rmOKFAILlist;

	
	ms=Get_ms();
//TaskID=b31-b28优先级,b27-b24方案类型,b23-b20采集类型,b19-b16存储时标类型,b15-b8任务号,b7-b0方案编号
//优先级:1=首要,2=必要,3=需要,4=可能
//方案类型:1=普通采集方案,2=事件采集方案,3=透明方案,4=上报方案,5=脚本方案,扩展14=终端事件(不上报),15=终端事件(上报)
//普通采集方案的采集类型:0=采集当前数据,1=采集上第N次,2=按冻结时标采集,3=按时标间隔采集,4=补抄
//普通采集方案的存储时标:0=未定义,1=任务开始时间,2=相对当日0点0分,3=相对上日23点59分,4=相对上日0点0分,5=相对当月1日0点0分,6=数据冻结时标
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	
	TaskID=UARTCtrl->TaskID;
	if(TaskID==0)
	{
		return;
	}
	id=(TaskID>>8)&0xff;
	if(id>=(RMTASKmax+ExtRMTASKmax))
	{
		return;
	}
	UARTCtrl->NUMrmTOTAL[id]=0;//任务需采集总数
	UARTCtrl->NUMrmOK[id]=0;//各任务已采集完成电能表数
	UARTCtrl->NUMrmBAD[id]=0;//各任务已采集完成的电能表数中因配置变更等原因不再需抄读的数
	//UARTCtrl->NUMrmFAIL[id]=0;//各任务已采集失败电能表数

	
//本端口在档案中配置的仪表总数
	NUMrm=0;//配置的仪表总数
	OADPORTn=PORTntoOAD(PORTn);
	for(i=0;i<NUM_RMmax;i++)
	{
		p8s=(u8*)ADDR_6000_SDRAM+(i*LENper_6000);
		if(p8s[0]==DataType_structure)
		{
			//端口
			p8d=Get_Element(p8s+5,4,0,0);//计算元素地址,使用ADDR_128KDATABUFF
			if(p8d)
			{
				x=(p8d[1]<<24)+(p8d[2]<<16)+(p8d[3]<<8)+p8d[4];//端口OAD
				if(x==OADPORTn)
				{
					NUMrm++;//配置的仪表总数
				}
			}
		}
	}
	UARTCtrl->NUM_SetMeter=NUMrm;//本端口在档案中配置的仪表总数
//各任务
	switch(id)
	{
		case RMTASKnoPOWER://停上电事件固定任务号
			NUMrm=0;//需采集总数
			OADPORTn=PORTntoOAD(PORTn);
			for(i=0;i<PowerEvent->NUMrm;i++)
			{
				x=PowerEvent->setno[i];
				p8s=(u8*)ADDR_6000_SDRAM+(x*LENper_6000);
				//端口
				p8d=Get_Element(p8s+5,4,0,0);//计算元素地址,使用ADDR_128KDATABUFF
				if(p8d)
				{
					x=(p8d[1]<<24)+(p8d[2]<<16)+(p8d[3]<<8)+p8d[4];//端口OAD
					if(x==OADPORTn)
					{
						NUMrm++;//需采集总数
					}
				}
			}
			UARTCtrl->NUMrmTOTAL[id]=NUMrm;//任务需采集总数
			return;
	}
	
	i=TaskID&0xff;//方案编号
	switch((TaskID>>24)&0xf)//方案类型
	{
		case 1://普通采集方案
			i*=LENper_6014;
			i+=ADDR_6014_SDRAM;
			p8s=(u8*)i;
			if(p8s[0]!=DataType_structure)
			{
				return;
			}
			pMS=Get_Element(p8s,5,0,0);//计算元素地址,使用ADDR_128KDATABUFF
			if(pMS==0)
			{
				return;
			}
/*
			//记录列选择CSD, 本函数中DateSaveTI()要用
			p8d=Get_Element(p8s,4,0,0);//计算元素地址,使用ADDR_128KDATABUFF
			if(p8d==0)
			{
				return;
			}
			i=UARTCtrl->RMCSDCount;//抄表CSD计数
			p8d=Get_Element(p8d,i+1,0,0);//计算元素地址,使用ADDR_128KDATABUFF
			if(p8d==0)
			{
				return;
			}
			i=(p8d[2]<<8)|(p8d[3]<<0);//采集数据的OI
			UARTCtrl->RMCSD[2]=i>>8;//OI
			UARTCtrl->RMCSD[3]=i;//OI
			switch(i)
			{
				case 0x5002://分钟冻结,采曲线数据,因会补抄上96点故用先用无效时间没相同文件名使已抄数为0,在RM_TxDATA.c中会每一点检查是否已抄
					UARTCtrl->RMCSD[2]=0xff;//无效的采集数据的OI,下DateSaveTI()要用
					UARTCtrl->RMCSD[3]=0xff;//无效的采集数据的OI,下DateSaveTI()要用
					break;
//				case 0x5004://日冻结
//				case 0x5006://月冻结
//				default:
//					break;
			}
*/
/*
			UARTCtrl->RMCSD[2]=0xff;//无效的采集数据的OI,下DateSaveTI()要用
			UARTCtrl->RMCSD[3]=0xff;//无效的采集数据的OI,下DateSaveTI()要用
*/
			break;
		case 2://事件采集方案
			i*=LENper_6016;
			i+=ADDR_6016_SDRAM;
			p8s=(u8*)i;
			if(p8s[0]!=DataType_structure)
			{
				return;
			}
			pMS=Get_Element(p8s,3,0,0);//计算元素地址,使用ADDR_128KDATABUFF
			if(pMS==0)
			{
				return;
			}
			break;
		case 3://透明方案
#if LENper_6018>LEN_128KDATABUFF
	#error
#endif
//#define ADDR_6018     ADDR_6016+LENmax_6016//透明方案集(初始化值0x00)
//属性2（透明方案）∷=structure//删除时structure的数据单元清为0(NULL)
//{
//	方案编号     unsigned，
//	方案内容集   array 方案内容，
			i*=LENper_6018;
			i+=ADDR_6018;
			MR(ADDR_128KDATABUFF,i,8);
			p8s=(u8*)ADDR_128KDATABUFF;
			if(p8s[0]!=DataType_structure)
			{
				return;
			}
			p8s+=4;
			x=p8s[1];
			if(x&0x80)
			{
				x=(p8s[2]<<8)+p8s[3];
				p8s+=4;
			}
			else
			{
				p8s+=2;
			}
			if(x>NUM_RMmax)
			{
				x=0;
			}
			UARTCtrl->NUMrmTOTAL[id]=x;//任务需采集总数
			//读文件已抄地址列表,原已采集完成数
			i=Get_FileID(PORTn);//UART各任务的FileID
			Comm_Ram->msFILESearchCount=0;
			filename=Get_RecordFileName(i,0,0);//搜索文件名:入口:FileID=b31-b28方案类型,b27-b24采集类型,b23-b20存储时标类型,b19-b12任务号,b11-b8端口号,b7-b0文件计数,相应域值为0xF表示不关注,pTime数据存储时标=0表示不关注;SearchCount=开始搜索的文件号0xFFFFFFFF表示从上次结束号开始搜索;返回:0--(FILENAMEmax_FLASH-1)表示文件在FLASH,FILENAMEmax_FLASH--(FILENAMEmax_RAM-1)表示文件在RAM,0xffffffff表示没找到
			if(filename!=0xffffffff)
			{
				if(filename<FILENAMEmax_FLASH)
				{
					file=(msFILE_TypeDef*)(ADDR_msFILEmanage+LEN_msFILEunltFlags+(filename*sizeof(msFILE_TypeDef)));
				}
				else
				{
					file=(msFILE_TypeDef*)(ADDR_RAMmsFILEmanage+((filename-FILENAMEmax_FLASH)*sizeof(msFILE_TypeDef)));
				}
				y=file->NUM_DATA;//文件存入数据个数计数(同抄表成功个数)
				if(y>NUM_RMmax)
				{
					y=0;
				}
				i=UARTCtrl->NUMrmFAIL[id];//各任务已采集失败电能表数
				if((y+i)>NUM_RMmax)
				{
					UARTCtrl->NUMrmFAIL[id]=NUM_RMmax-y;//各任务已采集失败电能表数
				}
				UARTCtrl->NUMrmOK[id]=y;//原已采集完成数
				ms->msfile_read(filename,0,(u8*)ADDR_AddrList,y*sizeof(RecordFileHead_TypeDef));
				RecordFileHead=(RecordFileHead_TypeDef*)(ADDR_AddrList);
				rmOKFAILlist=UARTCtrl->rmOKFAILlist[id];
				for(i=0;i<y;i++)
				{
					rmOKFAILlist->Addr0=RecordFileHead->Addr0;
					rmOKFAILlist->Addr1=RecordFileHead->Addr1;
					rmOKFAILlist->Addr2=RecordFileHead->Addr2;
					rmOKFAILlist++;
					RecordFileHead++;
				}
			}
			//计算原已采集完成数中的非法数
			p8d=p8s;//指向内容集
			y=UARTCtrl->NUMrmOK[id];//原已采集完成数
			if(y>=NUM_RMmax)
			{
				y=0;
			}
			NUMrm=0;//采集完成数中的非法数
			rmOKFAILlist=UARTCtrl->rmOKFAILlist[id];
			while(y--)
			{
				p8s=p8d;//恢复p8s
				//x=内容集数组个数
				for(i=0;i<x;i++)
				{
					OADPORTn=p8s[4]|(p8s[5]<<8);
					if(rmOKFAILlist->Addr0==OADPORTn)
					{
						OADPORTn=p8s[6]|(p8s[7]<<8);
						if(rmOKFAILlist->Addr1==OADPORTn)
						{
							OADPORTn=p8s[8]|(p8s[9]<<8);
							if(rmOKFAILlist->Addr2==OADPORTn)
							{
								break;
							}
						}
					}
					OADPORTn=Get_DL698DataLen_S(p8s,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:长度
					p8s+=OADPORTn;
				}
				if(i>=x)
				{//没找到相同地址
					NUMrm++;//采集完成数中的非法数
				}
				rmOKFAILlist++;
			}
			UARTCtrl->NUMrmBAD[id]=NUMrm;//采集完成数中的非法数
			//删除已采集失败数中的非法数
			rmOKFAILlist=UARTCtrl->rmOKFAILlist[id+1];
			rmOKFAILlist--;
			y=UARTCtrl->NUMrmFAIL[id];//原已采集失败数
			if(y>=NUM_RMmax)
			{
				y=0;
			}
			for(i=0;i<y;i++)
			{
				x=AddrToMeterSetNo((u16*)rmOKFAILlist);//搜索通信地址在采集档案配置表中的序号;返回:从0开始的配置序号,>=NUM_RMmax表示无效
				if(x<NUM_RMmax)
				{
					p8s=(u8*)ADDR_6000_SDRAM+(x*LENper_6000);
					if(p8s[0]==DataType_structure)
					{
						p8d=Get_Element(p8s+5,4,0,0);//计算元素地址,使用ADDR_128KDATABUFF
						if(p8d)
						{
							n=(p8d[1]<<24)+(p8d[2]<<16)+(p8d[3]<<8)+p8d[4];//端口OAD
							if(n==OADPORTn)
							{
								x=Compare_SETNO_MS((u8 *)ADDR_6000_SDRAM,x,pMS);//比较配置序号是否符合MS集合,入口:pADDR_6000已在RAM,pMS已在RAM并指向数据类型后的字节;出口:0=不符合,1=符合
								if(x)
								{
									rmOKFAILlist--;
									continue;
								}
							}
						}
					}
				}
				#if (LEN_RMokfailLIST*NUM_RMmax)>LEN_128KDATABUFF
					#error
				#endif
				MR(ADDR_128KDATABUFF,((u32)rmOKFAILlist)-((y-(i+1))*sizeof(RMokfailLIST_TypeDef)),(y-(i+1))*sizeof(RMokfailLIST_TypeDef));
				MW(ADDR_128KDATABUFF,(u32)rmOKFAILlist-((y-(i+1))*sizeof(RMokfailLIST_TypeDef))+sizeof(RMokfailLIST_TypeDef),(y-(i+1))*sizeof(RMokfailLIST_TypeDef));
				y--;
				rmOKFAILlist--;
			}
			UARTCtrl->NUMrmFAIL[id]=y;//原已采集失败数
			return;
		case 4://上报方案
		case 5://脚本方案
		default:
			break;
	}
	i=(TaskID>>24)&0xf;
	if(i<=2)
	{//1=普通采集方案,2=事件采集方案;(3=透明方案上已列表)
		pMS++;//指向数据类型后的字节
		NUMrm=0;//需采集总数
		OADPORTn=PORTntoOAD(PORTn);
		p8s=(u8*)ADDR_6000_SDRAM;
		for(i=0;i<NUMmax_6000;i++)
		{
			if(p8s[0]==DataType_structure)
			{
				p8d=Get_Element(p8s+5,4,0,0);//计算元素地址,使用ADDR_128KDATABUFF
				if(p8d)
				{
					x=(p8d[1]<<24)+(p8d[2]<<16)+(p8d[3]<<8)+p8d[4];//端口OAD
					if(x==OADPORTn)
					{
						x=Compare_SETNO_MS((u8*)ADDR_6000_SDRAM,i,pMS);//比较配置序号是否符合MS集合,入口:pADDR_6000已在RAM,pMS已在RAM并指向数据类型后的字节;出口:0=不符合,1=符合
						if(x)
						{
							NUMrm++;//需采集总数
						}
					}
				}
			}
			p8s+=LENper_6000;
		}
		UARTCtrl->NUMrmTOTAL[id]=NUMrm;//2byte任务需采集总数
		//读文件已抄地址列表,原已采集完成数
		Comm_Ram->msFILESearchCount=0;
		i=(TaskID>>24)&0xf;
		if(i==1)
		{//1=普通采集方案
			DateSaveTI(PORTn,UARTCtrl->date_time_s);//普通采集方案的采集存储时标;返回:pOUT=date_time_s
			i=Get_FileID(PORTn);//UART各任务的FileID
			filename=Get_RecordFileName(i,0xffffffff,UARTCtrl->date_time_s);//搜索文件名:入口:FileID=b31-b28方案类型,b27-b24采集类型,b23-b20存储时标类型,b19-b12任务号,b11-b8端口号,b7-b0文件计数,相应域值为0xF表示不关注,pTime数据存储时标=0表示不关注;SearchCount=开始搜索的文件号0xFFFFFFFF表示从上次结束号开始搜索;返回:0--(FILENAMEmax_FLASH-1)表示文件在FLASH,FILENAMEmax_FLASH--(FILENAMEmax_RAM-1)表示文件在RAM,0xffffffff表示没找到
		}
		else
		{//2=事件采集方案
			DateSaveTI(PORTn,UARTCtrl->date_time_s);//普通采集方案的采集存储时标;返回:pOUT=date_time_s
			i=Get_FileID(PORTn);//UART各任务的FileID
			filename=Get_RecordFileName(i,0,UARTCtrl->date_time_s);//搜索文件名:入口:FileID=b31-b28方案类型,b27-b24采集类型,b23-b20存储时标类型,b19-b12任务号,b11-b8端口号,b7-b0文件计数,相应域值为0xF表示不关注,pTime数据存储时标=0表示不关注;SearchCount=开始搜索的文件号0xFFFFFFFF表示从上次结束号开始搜索;返回:0--(FILENAMEmax_FLASH-1)表示文件在FLASH,FILENAMEmax_FLASH--(FILENAMEmax_RAM-1)表示文件在RAM,0xffffffff表示没找到
		}
		if(filename!=0xffffffff)
		{
			if(filename<FILENAMEmax_FLASH)
			{
				file=(msFILE_TypeDef*)(ADDR_msFILEmanage+LEN_msFILEunltFlags+(filename*sizeof(msFILE_TypeDef)));
			}
			else
			{
				file=(msFILE_TypeDef*)(ADDR_RAMmsFILEmanage+((filename-FILENAMEmax_FLASH)*sizeof(msFILE_TypeDef)));
			}
			y=file->NUM_DATA;//文件存入数据个数计数(同抄表成功个数)
			if(y>NUM_RMmax)
			{
				y=0;
			}
			i=UARTCtrl->NUMrmFAIL[id];//各任务已采集失败电能表数
			if((y+i)>NUM_RMmax)
			{
				UARTCtrl->NUMrmFAIL[id]=NUM_RMmax-y;//各任务已采集失败电能表数
			}
			UARTCtrl->NUMrmOK[id]=y;//原已采集完成数
			ms->msfile_read(filename,0,(u8*)ADDR_AddrList,y*sizeof(RecordFileHead_TypeDef));
			RecordFileHead=(RecordFileHead_TypeDef*)(ADDR_AddrList);
			rmOKFAILlist=UARTCtrl->rmOKFAILlist[id];
			for(i=0;i<y;i++)
			{
				rmOKFAILlist->Addr0=RecordFileHead->Addr0;
				rmOKFAILlist->Addr1=RecordFileHead->Addr1;
				rmOKFAILlist->Addr2=RecordFileHead->Addr2;
				rmOKFAILlist++;
				RecordFileHead++;
			}
		}
		NUMrm=0;//采集完成数中的非法数
		//计算原已采集完成数中的非法数
		y=UARTCtrl->NUMrmOK[id];//原已采集完成数
		if(y>NUM_RMmax)
		{
			y=0;
		}
		rmOKFAILlist=UARTCtrl->rmOKFAILlist[id];
		for(i=0;i<y;i++)
		{
			x=AddrToMeterSetNo((u16*)rmOKFAILlist);//搜索通信地址在采集档案配置表中的序号;返回:从0开始的配置序号,>=NUM_RMmax表示无效
			if(x<NUM_RMmax)
			{
				p8s=(u8*)ADDR_6000_SDRAM+(x*LENper_6000);
				if(p8s[0]==DataType_structure)
				{
					p8d=Get_Element(p8s+5,4,0,0);//计算元素地址,使用ADDR_128KDATABUFF
					if(p8d)
					{
						n=(p8d[1]<<24)+(p8d[2]<<16)+(p8d[3]<<8)+p8d[4];//端口OAD
						if(n==OADPORTn)
						{
							x=Compare_SETNO_MS((u8 *)ADDR_6000_SDRAM,x,pMS);//比较配置序号是否符合MS集合,入口:pADDR_6000已在RAM,pMS已在RAM并指向数据类型后的字节;出口:0=不符合,1=符合
							if(x)
							{
								rmOKFAILlist++;
								continue;
							}
						}
					}
				}
			}
			rmOKFAILlist++;
			NUMrm++;//采集完成数中的非法数
		}
		UARTCtrl->NUMrmBAD[id]=NUMrm;//非法数
		//删除已采集失败数中的非法数
		rmOKFAILlist=UARTCtrl->rmOKFAILlist[id+1];
		rmOKFAILlist--;
		y=UARTCtrl->NUMrmFAIL[id];//原已采集失败数
		if(y>=NUM_RMmax)
		{
			y=0;
		}
		for(i=0;i<y;i++)
		{
			x=AddrToMeterSetNo((u16*)rmOKFAILlist);//搜索通信地址在采集档案配置表中的序号;返回:从0开始的配置序号,>=NUM_RMmax表示无效
			if(x<NUM_RMmax)
			{
				p8s=(u8*)ADDR_6000_SDRAM+(x*LENper_6000);
				if(p8s[0]==DataType_structure)
				{
					p8d=Get_Element(p8s+5,4,0,0);//计算元素地址,使用ADDR_128KDATABUFF
					if(p8d)
					{
						n=(p8d[1]<<24)+(p8d[2]<<16)+(p8d[3]<<8)+p8d[4];//端口OAD
						if(n==OADPORTn)
						{
							x=Compare_SETNO_MS((u8 *)ADDR_6000_SDRAM,x,pMS);//比较配置序号是否符合MS集合,入口:pADDR_6000已在RAM,pMS已在RAM并指向数据类型后的字节;出口:0=不符合,1=符合
							if(x)
							{
								rmOKFAILlist--;
								continue;
							}
						}
					}
				}
			}
			#if (LEN_RMokfailLIST*NUM_RMmax)>LEN_128KDATABUFF
				#error
			#endif
			MR(ADDR_128KDATABUFF,((u32)rmOKFAILlist)-((y-(i+1))*sizeof(RMokfailLIST_TypeDef)),(y-(i+1))*sizeof(RMokfailLIST_TypeDef));
			MW(ADDR_128KDATABUFF,(u32)rmOKFAILlist-((y-(i+1))*sizeof(RMokfailLIST_TypeDef))+sizeof(RMokfailLIST_TypeDef),(y-(i+1))*sizeof(RMokfailLIST_TypeDef));
			y--;
			rmOKFAILlist--;
		}
		UARTCtrl->NUMrmFAIL[id]=y;//原已采集失败数
	}
	
//FileID=b31-b28方案类型,b27-b24采集类型,b23-b20存储时标类型,b19-b12任务号,b11-b8端口号,b7-b0文件分类,相应域值为0xFF表示不关注
//FileID采集类型 3=按时标间隔采集(曲线数据)
//TaskID采集类型 4=补抄
	i=Get_FileID(PORTn);//UART各任务的FileID
	if((((i>>24)&0xf)==3)||(((TaskID>>20)&0xf)==4))
	{//原已采集完成数=0;抄曲线和补抄(日冻结和曲线)需抄多个点,在发送管理时识别各点是否已抄
		UARTCtrl->NUMrmOK[id]=0;//原已采集完成数
	}
	
