gdgly/NUC97X_JS/STM32F4xx/DL698/RM_TASK.cpp
}

void RM_OK_FAIL(u32 PORTn,u32 OK)//抄表成功失败地址记录:入口:OK=0失败，=1成功,2=成功但数据为空
{
	u32 i;
	u32 x;
	u32 n;
	u32 m;
	u32 id;
	u32 Addr0;
	u32 Addr1;
	u32 Addr2;
	u8* p8;
	EventSour_typedef* EventSour;
	RMokfailLIST_TypeDef *rmOKFAILlist;
	UARTCtrl_TypeDef *UARTCtrl;
	
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	id=UARTCtrl->TaskID;
	if(id==0)
	{
		return;
	}
	id>>=8;
	id&=0xff;
	if(id>=(RMTASKmax+ExtRMTASKmax))
	{
		return;
	}
	Addr0=UARTCtrl->RMAddr[0];
	Addr1=UARTCtrl->RMAddr[1];
	Addr2=UARTCtrl->RMAddr[2];
	if(OK==1)
	{//成功
		n=UARTCtrl->NUMrmOK[id];
		if(n>=NUM_RMmax)
		{
			return;
		}
		//查原是否成功记录
		rmOKFAILlist=UARTCtrl->rmOKFAILlist[id];
		for(i=0;i<n;i++)
		{
			if(rmOKFAILlist->Addr0==Addr0)
			{
				if(rmOKFAILlist->Addr1==Addr1)
				{
					if(rmOKFAILlist->Addr2==Addr2)
					{
						break;
					}
				}
			}
			rmOKFAILlist++;
		}
		if(i>=n)
		{//没
			rmOKFAILlist->Addr0=Addr0;
			rmOKFAILlist->Addr1=Addr1;
			rmOKFAILlist->Addr2=Addr2;
			n++;
			UARTCtrl->NUMrmOK[id]=n;
			//查原是否失败记录
			m=UARTCtrl->NUMrmFAIL[id];
			if((n+m)>NUM_RMmax)
			{
				m=NUM_RMmax-n;//各任务已采集失败电能表数
			}
			rmOKFAILlist=UARTCtrl->rmOKFAILlist[id+1];
			rmOKFAILlist--;
			for(i=0;i<m;i++)
			{
				if(rmOKFAILlist->Addr0==Addr0)
				{
					if(rmOKFAILlist->Addr1==Addr1)
					{
						if(rmOKFAILlist->Addr2==Addr2)
						{
							break;
						}
					}
				}
				rmOKFAILlist--;
			}
			if(i<m)
			{//有
				#if (LEN_RMokfailLIST*NUM_RMmax)>LEN_128KDATABUFF
					#error
				#endif
				MR(ADDR_128KDATABUFF,((u32)rmOKFAILlist)-((m-(i+1))*sizeof(RMokfailLIST_TypeDef)),(m-(i+1))*sizeof(RMokfailLIST_TypeDef));
				MW(ADDR_128KDATABUFF,(u32)rmOKFAILlist-((m-(i+1))*sizeof(RMokfailLIST_TypeDef))+sizeof(RMokfailLIST_TypeDef),(m-(i+1))*sizeof(RMokfailLIST_TypeDef));
				m--;
				UARTCtrl->NUMrmFAIL[id]=m;
			}
		}
		//终端抄表失败事件
		if((PORTn==RS485_1PORT)||(PORTn==RS485_2PORT))
		{
			i=MRR(ADDR_310F_6+5,1);//关联采集任务号
			if(i==id)
			{
				EventSour=GET_EventSour((u16*)UARTCtrl->RMAddr);//得到事件原值数据指针，入口:抄表地址, 返回:数据指针,0=错误
				if(EventSour)
				{
					EventSour->Re=0;//抄表失败(310F)重试轮次
					if((EventSour->Occur&1)==1)//b0=抄表失败(310F)
					{
						EventSour->Occur&=~1;//b0=抄表失败(310F)
						p8=(u8*)ADDR_128KDATABUFF+(64*1024);
						p8[0]=0;//事件发生前正向有功总电能=空
						p8[1024]=0;//事件结束后正向有功总电能=空
						p8+=512;
						p8[0]=DataType_TSA;//产生源
						p8[1]=7;
						p8[2]=5;
						p8[3]=Addr0;
						p8[4]=Addr0>>8;
						p8[5]=Addr1;
						p8[6]=Addr1>>8;
						p8[7]=Addr2;
						p8[8]=Addr2>>8;
						Event_OAD(0x310F0200,p8,0,2);//标准事件记录;入口:OAD,pOccurSour产生源=0表示空,occur=0恢复=1产生=2无,OccurkWh=0恢复=1产生=2无;返回:0=没记录,1=记录;使用ADDR_DATABUFF和ADDR_128KDATABUFF
					}
				}
			}
		}
		//RS485设备故障事件记录恢复
		if((PORTn==RS485_1PORT)||(PORTn==RS485_2PORT))
		{
			if(UARTCtrl->EVENT_FAIL==1)//设备故障事件记录(485或载波通道),0=空或恢复,1=产生
			{
				UARTCtrl->EVENT_FAIL=0;//设备故障事件记录(485或载波通道),0=空或恢复,1=产生
				p8=(u8*)ADDR_128KDATABUFF+(64*1024);
				p8[0]=0;//事件发生前正向有功总电能=空
				p8[1024]=0;//事件结束后正向有功总电能=空
				p8+=512;
				p8[0]=DataType_enum;//产生源
				p8[1]=3;//485抄表故障    （3）
				Event_OAD(0x310A0200,p8,0,2);//标准事件记录;入口:OAD,pOccurSour产生源=0表示空,occur=0恢复=1产生=2无,OccurkWh=0恢复=1产生=2无;返回:0=没记录,1=记录;使用ADDR_DATABUFF和ADDR_128KDATABUFF
			}
		}
	}
	else
	{//失败或空数据
		//查原是否成功记录
		n=UARTCtrl->NUMrmOK[id];
		if(n>=NUM_RMmax)
		{
			return;
		}
		rmOKFAILlist=UARTCtrl->rmOKFAILlist[id];
		for(i=0;i<n;i++)
		{
			if(rmOKFAILlist->Addr0==Addr0)
			{
				if(rmOKFAILlist->Addr1==Addr1)
				{
					if(rmOKFAILlist->Addr2==Addr2)
					{
						return;
					}
				}
			}
			rmOKFAILlist++;
		}
		//查原是否失败记录
		m=UARTCtrl->NUMrmFAIL[id];
		if((n+m)>NUM_RMmax)
		{
			m=NUM_RMmax-n;//各任务已采集失败电能表数
		}
		rmOKFAILlist=UARTCtrl->rmOKFAILlist[id+1];
		rmOKFAILlist--;
		for(i=0;i<m;i++)
		{
			if(rmOKFAILlist->Addr0==Addr0)
			{
				if(rmOKFAILlist->Addr1==Addr1)
				{
					if(rmOKFAILlist->Addr2==Addr2)
					{
						rmOKFAILlist->ReRMCount=UARTCtrl->ReRMCount;
						rmOKFAILlist->SpaceData=OK;//0=失败,1=,2=抄表正常但数据为空标志失败(台体测试采集监控计为抄表失败)
						break;
					}
				}
			}
			rmOKFAILlist--;
		}
		if(i>=m)
		{//没
			if((n+m)>=NUM_RMmax)
			{
				return;
			}
			rmOKFAILlist->Addr0=Addr0;
			rmOKFAILlist->Addr1=Addr1;
			rmOKFAILlist->Addr2=Addr2;
			rmOKFAILlist->ReRMCount=UARTCtrl->ReRMCount;
			rmOKFAILlist->SpaceData=OK;//0=失败,1=,2=抄表正常但数据为空标志失败(台体测试采集监控计为抄表失败)
			m++;
			UARTCtrl->NUMrmFAIL[id]=m;
			//终端抄表失败事件
			if((PORTn==RS485_1PORT)||(PORTn==RS485_2PORT))
			{
				i=MRR(ADDR_310F_6+3,3);//重试轮次,关联采集任务号
				if((i>>16)==id)
				{
					i&=0xff;//参数中的重试轮次
					EventSour=GET_EventSour((u16*)UARTCtrl->RMAddr);//得到事件原值数据指针，入口:抄表地址, 返回:数据指针,0=错误
					if(EventSour)
					{
						if(EventSour->Re>=i)
						{
							if((EventSour->Occur&1)==0)//b0=抄表失败(310F)
							{
								EventSour->Occur|=1;//b0=抄表失败(310F)
								p8=(u8*)ADDR_128KDATABUFF+(64*1024);
								p8[0]=0;//事件发生前正向有功总电能=空
								p8[1024]=0;//事件结束后正向有功总电能=空
								p8+=512;
								p8[0]=DataType_TSA;//产生源
								p8[1]=7;
								p8[2]=5;
								p8[3]=Addr0;
								p8[4]=Addr0>>8;
								p8[5]=Addr1;
								p8[6]=Addr1>>8;
								p8[7]=Addr2;
								p8[8]=Addr2>>8;
								Event_OAD(0x310F0200,p8,1,2);//标准事件记录;入口:OAD,pOccurSour产生源=0表示空,occur=0恢复=1产生=2无,OccurkWh=0恢复=1产生=2无;返回:0=没记录,1=记录;使用ADDR_DATABUFF和ADDR_128KDATABUFF
							}
						}
						if(EventSour->Re!=0xff)//抄表失败(310F)重试轮次
						{
							EventSour->Re++;//抄表失败(310F)重试轮次
						}
					}
				}
			}
		}
		//RS485设备故障事件记录产生
		if((PORTn==RS485_1PORT)||(PORTn==RS485_2PORT))
		{
			if(UARTCtrl->EVENT_FAIL==0)//设备故障事件记录(485或载波通道),0=空或恢复,1=产生
			{
			#if LEN_DATABUFF<NUM_RMmax
				#error
			#endif
				MC(0,ADDR_DATABUFF,NUM_RMmax);
				p8=(u8*)ADDR_DATABUFF;
				n=0;//总有失败表数
				for(id=1;id<RMTASKmax;id++)
				{
					//统计失败记录的各表数
					m=UARTCtrl->NUMrmFAIL[id];
					if(m>NUM_RMmax)
					{
						m=NUM_RMmax;
					}
					rmOKFAILlist=UARTCtrl->rmOKFAILlist[id+1];
					rmOKFAILlist--;
					for(i=0;i<m;i++)
					{
						x=AddrToMeterSetNo((u16*)rmOKFAILlist);//搜索通信地址在采集档案配置表中的序号;返回:从0开始的配置序号,>=NUM_RMmax表示无效
						if(x<NUM_RMmax)
						{
							if(p8[x]==0)
							{
								p8[x]=1;
								n++;//总有失败表数+1
							}
						}
						rmOKFAILlist--;
					}
				}
				if(n>=UARTCtrl->NUM_SetMeter)//本端口在档案中配置的仪表总数
				{
					UARTCtrl->EVENT_FAIL=1;//设备故障事件记录(485或载波通道),0=空或恢复,1=产生
					p8=(u8*)ADDR_128KDATABUFF+(64*1024);
					p8[0]=0;//事件发生前正向有功总电能=空
					p8[1024]=0;//事件结束后正向有功总电能=空
					p8+=512;
					p8[0]=DataType_enum;//产生源
					p8[1]=3;//485抄表故障    （3）
					Event_OAD(0x310A0200,p8,1,2);//标准事件记录;入口:OAD,pOccurSour产生源=0表示空,occur=0恢复=1产生=2无,OccurkWh=0恢复=1产生=2无;返回:0=没记录,1=记录;使用ADDR_DATABUFF和ADDR_128KDATABUFF
				}
			}
		}
	}
}

void RM_ADDR_Display(u32 PORTn)//抄表地址显示
{
	u32 i;
	u32 x;
	u8* p8;
	UARTCtrl_TypeDef * UARTCtrl;
	
