gdgly/NUC97X_JS/STM32F4xx/DL698/RM_TASK.cpp
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	p8=(u8*)ADDR_DATABUFF;
	if((PORTn==RS485_1PORT)||(PORTn==RS485_2PORT))
	{
		CopyString((u8 *)"485     ",(u8*)ADDR_DATABUFF);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
		if(PORTn==RS485_1PORT)
		{
			i=1;
		}
		else
		{
			i=2;
		}
		p8[3]=i;
	}
	else
	{
		if(PORTn==ACSAMPLEPORT)
		{//交采
			CopyString((u8 *)"交采     ",(u8*)ADDR_DATABUFF);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
		}
		else
		{
			CopyString((u8 *)"载波     ",(u8*)ADDR_DATABUFF);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
		}
	}
//广播校时任务
	if((UARTCtrl->BroadcastTimeTask&0x7f)>=2)//广播校时任务:0=空,1=校时-2等待开始,2-127校时-2过程;0x81=校时-3等待开始,0x82-0xFF校时-3过程
	{//正在执行广播校时
		CopyString((u8 *)"广播校时",(u8*)ADDR_DATABUFF+6);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
		p8[14]=0;
		WarningOccur(PORTn,(u8 *)ADDR_DATABUFF);//告警发生,入口告警代码和告警字符串
		return;
	}
//任务号	
	i=UARTCtrl->TaskID;
	i>>=8;
	i&=0xff;
	i=hex_bcd(i);
	if(i<0x10)
	{
		p8[5]=i+0x30;
	}
	else
	{
		if(i<0x100)
		{
			p8[5]=(i>>4)+0x30;
			p8[6]=(i&0xf)+0x30;
		}
		else
		{
			p8[5]=((i>>8)&0xf)+0x30;
			p8[6]=((i>>4)&0xf)+0x30;
			p8[7]=(i&0xf)+0x30;
		}
	}
//电能表主动上报任务
	if(UARTCtrl->AutoReportTask>=2)//电能表主动上报任务:0=空,1=有主动上报等待读取,2...抄读中
	{
		CopyString((u8 *)"上报",(u8*)ADDR_DATABUFF+4);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
	}
//12位地址
	p8+=8;
	for(i=0;i<3;i++)
	{
		x=UARTCtrl->RMAddr[i];
		if(((x>>4)&0xf)<10)
		{
			p8[0]=((x>>4)&0xf)+0x30;
		}
		else
		{	
			p8[0]=((x>>4)&0xf)+55;
		}
		p8++;
		if((x&0xf)<10)
		{
			p8[0]=(x&0xf)+0x30;
		}
		else
		{
			p8[0]=(x&0xf)+55;
		}
		p8++;
		x>>=8;
		if(((x>>4)&0xf)<10)
		{
			p8[0]=((x>>4)&0xf)+0x30;
		}
		else
		{	
			p8[0]=((x>>4)&0xf)+55;
		}
		p8++;
		if((x&0xf)<10)
		{
			p8[0]=(x&0xf)+0x30;
		}
		else
		{
			p8[0]=(x&0xf)+55;
		}
		p8++;
	}
	p8[0]=0;
	WarningOccur(PORTn,(u8 *)ADDR_DATABUFF);//告警发生,入口告警代码和告警字符串
}

void PROXY_ADDR_Display(u32 PORTn)//代理地址显示
{
	u32 i;
	u32 x;
	u8* p8;
	UARTCtrl_TypeDef * UARTCtrl;
	UARTCtrl_TypeDef * UARTCtrlProxy;
	
	if(PORTn==ACSAMPLEPORT)
	{//交采
		return;
	}
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	p8=(u8*)ADDR_DATABUFF;
	if((PORTn==RS485_1PORT)||(PORTn==RS485_2PORT))
	{
		CopyString((u8 *)"485  转  ",(u8*)ADDR_DATABUFF);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
		if(PORTn==RS485_1PORT)
		{
			i=1;
		}
		else
		{
			i=2;
		}
		p8[3]=i;
	}
	else
	{
		CopyString((u8 *)"载波 转  ",(u8*)ADDR_DATABUFF);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
	}
	UARTCtrlProxy=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(UARTCtrl->ProxyPORTn);
	p8+=8;
	for(i=0;i<3;i++)
	{
		x=UARTCtrlProxy->RMAddr[i];
		if(((x>>4)&0xf)<10)
		{
			p8[0]=((x>>4)&0xf)+0x30;
		}
		else
		{	
			p8[0]=((x>>4)&0xf)+55;
		}
		p8++;
		if((x&0xf)<10)
		{
			p8[0]=(x&0xf)+0x30;
		}
		else
		{
			p8[0]=(x&0xf)+55;
		}
		p8++;
		x>>=8;
		if(((x>>4)&0xf)<10)
		{
			p8[0]=((x>>4)&0xf)+0x30;
		}
		else
		{	
			p8[0]=((x>>4)&0xf)+55;
		}
		p8++;
		if((x&0xf)<10)
		{
			p8[0]=(x&0xf)+0x30;
		}
		else
		{
			p8[0]=(x&0xf)+55;
		}
		p8++;
	}
	p8[0]=0;
	WarningOccur(PORTn,(u8 *)ADDR_DATABUFF);//告警发生,入口告警代码和告警字符串
}



void RM_NUM_Display(u32 PORTn)//抄表数量显示
{
	u32 i;
	u32 x;
	u32 id;
	u8* p8;
	u32 TaskID;
	UARTCtrl_TypeDef * UARTCtrl;
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	//id=UARTCtrl->LastTaskID;//最近上次有效采集任务ID,用于显示等
	id=UARTCtrl->TaskID;
	id>>=8;
	id&=0xff;
	if((PORTn==RS485_1PORT)||(PORTn==RS485_2PORT))
	{
		//CopyString((u8 *)"485x____成____败____",(u8*)ADDR_DATABUFF);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
		CopyString((u8 *)"485x____ 成功____",(u8*)ADDR_DATABUFF);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
		p8=(u8*)(ADDR_DATABUFF);
		if(PORTn==RS485_1PORT)
		{
			i=1;
		}
		else
		{
			i=2;
		}
		p8[3]=i;
	}
	else
	{
		if(PORTn==ACSAMPLEPORT)
		{//交采
			CopyString((u8 *)"交采____ 成功____",(u8*)ADDR_DATABUFF);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
		}
		else
		{
			//CopyString((u8 *)"载波____成____败____",(u8*)ADDR_DATABUFF);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
			CopyString((u8 *)"载波____ 成功____",(u8*)ADDR_DATABUFF);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
		}
	}
	//总数
	p8=(u8*)(ADDR_DATABUFF+4+3);
	p8[0]='0';
	i=UARTCtrl->NUMrmTOTAL[id];
	i=hex_bcd(i);
	while(i)
	{
		p8[0]=(i&0xf)+0x30;
		p8--;
		i>>=4;
	}
	//成功数
	p8=(u8*)(ADDR_DATABUFF+13+3);
	p8[0]='0';
	TaskID=UARTCtrl->TaskID;
	i=Get_FileID(PORTn);//UART各任务的FileID
	if((((i>>24)&0xf)==3)||(((TaskID>>20)&0xf)==4))
	{//原已采集完成数=0;抄曲线和补抄(日冻结和曲线)需抄多个点,在发送管理时识别各点是否已抄
		//UARTCtrl->NUMrmOK[id]=0;//原已采集完成数
		i=UARTCtrl->NUMrmOK[id];
	}
	else
	{
		i=UARTCtrl->NUMrmOK[id];
		x=UARTCtrl->NUMrmBAD[id];
		if(i>=x)
		{
			i-=x;
		}
		else
		{
			i=0;
		}
	}
	i=hex_bcd(i);
	while(i)
	{
		p8[0]=(i&0xf)+0x30;
		p8--;
		i>>=4;
	}
	p8=(u8*)(ADDR_DATABUFF+17);
	p8[0]=0;
	//失败数
/*
	p8=(u8*)(ADDR_DATABUFF+16+3);
	p8[0]='0';
	p8[1]=0;
	i=UARTCtrl->NUMrmFAIL[id];
	i=hex_bcd(i);
	while(i)
	{
		p8[0]=(i&0xf)+0x30;
		p8--;
		i>>=4;
	}
*/
	if(PORTn==RS485_4PORT)
	{//载波口
		WarningOccur(100,(u8 *)ADDR_DATABUFF);//告警发生,入口告警代码和告警字符串
	}
	else
	{
		WarningOccur(PORTn,(u8 *)ADDR_DATABUFF);//告警发生,入口告警代码和告警字符串
	}
}


void RM_Monitor_Init(u32 ID)//采集任务监控初始化;入口:ID=任务号
{
	u8 *p8;
	UARTCtrl_TypeDef *UARTCtrl_1;
	UARTCtrl_TypeDef *UARTCtrl_2;
#if ((Project/100)==2)||((Project/100)==4)//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
	UARTCtrl_TypeDef *UARTCtrl_4;
#endif
	
	if(ID>=RMTASKmax)
	{
		return;
	}
	UARTCtrl_1=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(RS485_1PORT);
	UARTCtrl_2=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(RS485_2PORT);
#if ((Project/100)==2)||((Project/100)==4)//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
	UARTCtrl_4=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(RS485_4PORT);
#endif
	if(UARTCtrl_1->TaskTime[ID].Run==1)//任务执行状态:0=未执行,1=执行中,2=已执行
	{
		return;
	}
	if(UARTCtrl_2->TaskTime[ID].Run==1)//任务执行状态:0=未执行,1=执行中,2=已执行
	{
		return;
	}
#if (Project/100)==2//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
	if(UARTCtrl_4->TaskTime[ID].Run==1)//任务执行状态:0=未执行,1=执行中,2=已执行
	{
		return;
	}
#endif
#if (Project/100)==4//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
	if(Comm_Ram->MODE3in1==1)//三合一终端当前运行模式:0=专变,1=集中器
	{
		if(UARTCtrl_4->TaskTime[ID].Run==1)//任务执行状态:0=未执行,1=执行中,2=已执行
		{
			return;
		}
	}
#endif
	UARTCtrl_1->TaskTime[ID].Run=0;//任务执行状态:0=未执行,1=执行中,2=已执行
	UARTCtrl_2->TaskTime[ID].Run=0;//任务执行状态:0=未执行,1=执行中,2=已执行
#if ((Project/100)==2)||((Project/100)==4)//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
	UARTCtrl_4->TaskTime[ID].Run=0;//任务执行状态:0=未执行,1=执行中,2=已执行
#endif
	p8=(u8*)ADDR_6034+(ID*LENper_6034);
//0 采集任务监控单元∷=structure
	p8[0]=DataType_structure;
	p8[1]=8;
//{
//2 任务ID       unsigned
	p8[2]=DataType_unsigned;
	p8[3]=ID;
//4 任务执行状态  enum
//{
//	未执行（0）
//	执行中（1）
//	已执行（2）
//}，
	p8[4]=DataType_enum;
	p8[5]=0;
//6 任务执行开始时间   date_time_s，//用各端口时间值小的
	p8[6]=DataType_date_time_s;
	p8[7]=0xff;
	p8[8]=0xff;
	p8[9]=0xff;
	p8[10]=0xff;
	p8[11]=0xff;
	p8[12]=0xff;
	p8[13]=0xff;
//14 任务执行结束时间   date_time_s，//用各端口时间值大的
	p8[14]=DataType_date_time_s;
	p8[15]=0xff;
	p8[16]=0xff;
	p8[17]=0xff;
	p8[18]=0xff;
	p8[19]=0xff;
	p8[20]=0xff;
	p8[21]=0xff;
//22 采集总数量         long-unsigned，
	p8[22]=DataType_long_unsigned;
	p8[23]=0;
	p8[24]=0;
//25 采集成功数量       long-unsigned，
	p8[25]=DataType_long_unsigned;
	p8[26]=0;
	p8[27]=0;
//28 已发送报文条数     long-unsigned，
	p8[28]=DataType_long_unsigned;
	p8[29]=0;
	p8[30]=0;
//31 已接收报文条数     long-unsigned
	p8[31]=DataType_long_unsigned;
	p8[32]=0;
	p8[33]=0;
//}
}

void RM_Monitor_Init_PORTn(u32 PORTn,u32 ID)//采集任务监控初始化(按端口号);入口:PORTn=端口号,ID=任务号
{
	u8 *p8;
	UARTCtrl_TypeDef *UARTCtrl_1;
	UARTCtrl_TypeDef *UARTCtrl_2;
#if ((Project/100)==2)||((Project/100)==4)//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
	UARTCtrl_TypeDef *UARTCtrl_4;
#endif
	
	if(ID>=RMTASKmax)
	{
		return;
	}
	UARTCtrl_1=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(RS485_1PORT);
	UARTCtrl_2=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(RS485_2PORT);
#if ((Project/100)==2)||((Project/100)==4)//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
	UARTCtrl_4=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(RS485_4PORT);
#endif
	if(UARTCtrl_1->TaskTime[ID].Run==1)//任务执行状态:0=未执行,1=执行中,2=已执行
	{
		return;
	}
	if(UARTCtrl_2->TaskTime[ID].Run==1)//任务执行状态:0=未执行,1=执行中,2=已执行
	{
		return;
	}
#if (Project/100)==2//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
	if(UARTCtrl_4->TaskTime[ID].Run==1)//任务执行状态:0=未执行,1=执行中,2=已执行
	{
		return;
	}
#endif
#if (Project/100)==4//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
	if(Comm_Ram->MODE3in1==1)//三合一终端当前运行模式:0=专变,1=集中器
	{
		if(UARTCtrl_4->TaskTime[ID].Run==1)//任务执行状态:0=未执行,1=执行中,2=已执行
		{
			return;
		}
	}
#endif
	if(PORTn==RS485_1PORT)
	{
		UARTCtrl_1->TaskTime[ID].Run=0;//任务执行状态:0=未执行,1=执行中,2=已执行
	}
	if(PORTn==RS485_2PORT)
	{
		UARTCtrl_2->TaskTime[ID].Run=0;//任务执行状态:0=未执行,1=执行中,2=已执行
	}
#if ((Project/100)==2)||((Project/100)==4)//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
	if(PORTn==RS485_4PORT)
	{
		UARTCtrl_4->TaskTime[ID].Run=0;//任务执行状态:0=未执行,1=执行中,2=已执行
	}
#endif
	p8=(u8*)ADDR_6034+(ID*LENper_6034);
//0 采集任务监控单元∷=structure
	p8[0]=DataType_structure;
	p8[1]=8;
//{
//2 任务ID       unsigned
	p8[2]=DataType_unsigned;
	p8[3]=ID;
//4 任务执行状态  enum
//{
//	未执行（0）
//	执行中（1）
//	已执行（2）
//}，
	p8[4]=DataType_enum;
	p8[5]=0;
//6 任务执行开始时间   date_time_s，//用各端口时间值小的
	p8[6]=DataType_date_time_s;
	p8[7]=0xff;
	p8[8]=0xff;
	p8[9]=0xff;
	p8[10]=0xff;
	p8[11]=0xff;
	p8[12]=0xff;
	p8[13]=0xff;
//14 任务执行结束时间   date_time_s，//用各端口时间值大的
	p8[14]=DataType_date_time_s;
	p8[15]=0xff;
	p8[16]=0xff;
	p8[17]=0xff;
	p8[18]=0xff;
	p8[19]=0xff;
	p8[20]=0xff;
	p8[21]=0xff;
//22 采集总数量         long-unsigned，
	p8[22]=DataType_long_unsigned;
	p8[23]=0;
	p8[24]=0;
//25 采集成功数量       long-unsigned，
	p8[25]=DataType_long_unsigned;
	p8[26]=0;
	p8[27]=0;
//28 已发送报文条数     long-unsigned，
	p8[28]=DataType_long_unsigned;
	p8[29]=0;
	p8[30]=0;
//31 已接收报文条数     long-unsigned
	p8[31]=DataType_long_unsigned;
	p8[32]=0;
	p8[33]=0;
//}
}



void RM_Monitor(u32 ID,u32 NUM_Tx,u32 NUM_Rx)//采集任务监控;入口:ID=任务号,NUM_Tx=发送条数,NUM_Rx=接收条数
{
	u32 i;
	u32 x;
	u32 y;
	u8* p8;
	UARTCtrl_TypeDef *UARTCtrl_1;
	UARTCtrl_TypeDef *UARTCtrl_2;
#if ((Project/100)==2)||((Project/100)==4)//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
	UARTCtrl_TypeDef *UARTCtrl_4;
#endif
	u32 NUM_OK;
	u32 SourTaskID;
	u32 TaskID;
	u32 FileID;
	
	if(ID>=RMTASKmax)
	{
		return;
	}
	p8=(u8*)ADDR_6034+(ID*LENper_6034);
	i=MRR(ADDR_6012_2_SDRAM+(ID*LENper_6012_2),1);
	if(i!=DataType_structure)
	{
		p8[0]=0;//删除时structure的数据单元清为0(NULL)
		return;
	}
	UARTCtrl_1=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(RS485_1PORT);
	if(UARTCtrl_1->Function==0)//口功能 0=终端维护口,!=0终端抄表口
	{
		UARTCtrl_1->TaskTime[ID].Run=2;//任务执行状态:0=未执行,1=执行中,2=已执行,3=执行中暂停,4=执行未完成
	}
	UARTCtrl_2=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(RS485_2PORT);
	if(UARTCtrl_2->Function==0)//口功能 0=终端维护口,!=0终端抄表口
	{
		UARTCtrl_2->TaskTime[ID].Run=2;//任务执行状态:0=未执行,1=执行中,2=已执行,3=执行中暂停,4=执行未完成
	}
#if ((Project/100)==2)||((Project/100)==4)//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
	UARTCtrl_4=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(RS485_4PORT);
#endif
//0 采集任务监控单元∷=structure
	p8[0]=DataType_structure;
	p8[1]=8;
//{
//2 任务ID       unsigned
	p8[2]=DataType_unsigned;
	p8[3]=ID;
//4 任务执行状态  enum
//{
//	未执行（0）
//	执行中（1）
//	已执行（2）
//}，
	p8[4]=DataType_enum;
	p8[5]=0;
#if (Project/100)==2//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
	if((UARTCtrl_1->TaskTime[ID].Run==1)||(UARTCtrl_2->TaskTime[ID].Run==1)||(UARTCtrl_4->TaskTime[ID].Run==1))//任务执行状态:0=未执行,1=执行中,2=已执行,3=执行中暂停,4=执行未完成
	{
		p8[5]=1;
	}
	else
	{
		if((UARTCtrl_1->TaskTime[ID].Run==2)&&(UARTCtrl_2->TaskTime[ID].Run==2)&&(UARTCtrl_4->TaskTime[ID].Run==2))//任务执行状态:0=未执行,1=执行中,2=已执行,3=执行中暂停,4=执行未完成
		{
			p8[5]=2;
		}
	}
#endif
#if (Project/100)==3//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
	if((UARTCtrl_1->TaskTime[ID].Run==1)||(UARTCtrl_2->TaskTime[ID].Run==1))//任务执行状态:0=未执行,1=执行中,2=已执行,3=执行中暂停,4=执行未完成
	{
		p8[5]=1;
	}
	else
	{
		if((UARTCtrl_1->TaskTime[ID].Run==2)&&(UARTCtrl_2->TaskTime[ID].Run==2))//任务执行状态:0=未执行,1=执行中,2=已执行,3=执行中暂停,4=执行未完成
		{
			p8[5]=2;
		}
	}
#endif
#if (Project/100)==4//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
	if(Comm_Ram->MODE3in1==1)//三合一终端当前运行模式:0=专变,1=集中器
	{
		if((UARTCtrl_1->TaskTime[ID].Run==1)||(UARTCtrl_2->TaskTime[ID].Run==1)||(UARTCtrl_4->TaskTime[ID].Run==1))//任务执行状态:0=未执行,1=执行中,2=已执行,3=执行中暂停,4=执行未完成
		{
			p8[5]=1;
		}
		else
		{
			if((UARTCtrl_1->TaskTime[ID].Run==2)&&(UARTCtrl_2->TaskTime[ID].Run==2)&&(UARTCtrl_4->TaskTime[ID].Run==2))//任务执行状态:0=未执行,1=执行中,2=已执行,3=执行中暂停,4=执行未完成
			{
				p8[5]=2;
			}
		}
	}
	else
	{
		if((UARTCtrl_1->TaskTime[ID].Run==1)||(UARTCtrl_2->TaskTime[ID].Run==1))//任务执行状态:0=未执行,1=执行中,2=已执行,3=执行中暂停,4=执行未完成
		{
			p8[5]=1;
		}
		else
		{
			if((UARTCtrl_1->TaskTime[ID].Run==2)&&(UARTCtrl_2->TaskTime[ID].Run==2))//任务执行状态:0=未执行,1=执行中,2=已执行,3=执行中暂停,4=执行未完成
			{
				p8[5]=2;
			}
		}
	}
#endif
//6 任务执行开始时间   date_time_s，//用各端口时间值小的
	p8[6]=DataType_date_time_s;
	p8[7]=0xff;
	p8[8]=0xff;
	p8[9]=0xff;
	p8[10]=0xff;
	p8[11]=0xff;
	p8[12]=0xff;
	p8[13]=0xff;
//	if(UARTCtrl_1->TaskTime[ID].Run)//任务执行状态:0=未执行,1=执行中,2=已执行,3=执行中暂停,4=执行未完成
//	{
		i=UARTCtrl_1->TaskTime[ID].StartTime[2];
		if((i!=0)&&(i!=0xff))
		{
			MR((u32)p8+7,(u32)&UARTCtrl_1->TaskTime[ID].StartTime,7);
		}
//	}
//	if(UARTCtrl_2->TaskTime[ID].Run)//任务执行状态:0=未执行,1=执行中,2=已执行,3=执行中暂停,4=执行未完成
//	{
		i=UARTCtrl_2->TaskTime[ID].StartTime[2];
		if((i!=0)&&(i!=0xff))
		{
			i=Compare_DL698DataString(p8+7,(u8 *)&UARTCtrl_2->TaskTime[ID].StartTime,7);//数据串比较(高位在低字节),p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
			if(i==2)
			{//p1<p2
				MR((u32)p8+7,(u32)&UARTCtrl_2->TaskTime[ID].StartTime,7);
			}
		}
//	}
#if (Project/100)==2//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
//	if(UARTCtrl_4->TaskTime[ID].Run)//任务执行状态:0=未执行,1=执行中,2=已执行,3=执行中暂停,4=执行未完成
//	{
		i=UARTCtrl_4->TaskTime[ID].StartTime[2];
		if((i!=0)&&(i!=0xff))
		{
			i=Compare_DL698DataString(p8+7,(u8 *)&UARTCtrl_4->TaskTime[ID].StartTime,7);//数据串比较(高位在低字节),p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
			if(i==2)
			{//p1<p2
				MR((u32)p8+7,(u32)&UARTCtrl_4->TaskTime[ID].StartTime,7);
			}
		}
//	}
#endif
#if (Project/100)==4//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
	if(Comm_Ram->MODE3in1==1)//三合一终端当前运行模式:0=专变,1=集中器
	{
//		if(UARTCtrl_4->TaskTime[ID].Run)//任务执行状态:0=未执行,1=执行中,2=已执行,3=执行中暂停,4=执行未完成
//		{
			i=UARTCtrl_4->TaskTime[ID].StartTime[2];
			if((i!=0)&&(i!=0xff))
			{
				i=Compare_DL698DataString(p8+7,(u8 *)&UARTCtrl_4->TaskTime[ID].StartTime,7);//数据串比较(高位在低字节),p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
				if(i==2)
				{//p1<p2
					MR((u32)p8+7,(u32)&UARTCtrl_4->TaskTime[ID].StartTime,7);
				}
			}
//		}
	}
#endif
//14 任务执行结束时间   date_time_s，//用各端口时间值大的
	p8[14]=DataType_date_time_s;
	p8[15]=0;
	p8[16]=0;
	p8[17]=0;
	p8[18]=0;
	p8[19]=0;
	p8[20]=0;
	p8[21]=0;
//	if(UARTCtrl_1->TaskTime[ID].Run)//任务执行状态:0=未执行,1=执行中,2=已执行,3=执行中暂停,4=执行未完成
//	{
		i=UARTCtrl_1->TaskTime[ID].EndTime[2];
		if((i!=0)&&(i!=0xff))
		{
			MR((u32)p8+15,(u32)&UARTCtrl_1->TaskTime[ID].EndTime,7);
		}
//	}
//	if(UARTCtrl_2->TaskTime[ID].Run)//任务执行状态:0=未执行,1=执行中,2=已执行,3=执行中暂停,4=执行未完成
//	{
		i=UARTCtrl_2->TaskTime[ID].EndTime[2];
		if((i!=0)&&(i!=0xff))
		{
			i=Compare_DL698DataString(p8+15,(u8 *)&UARTCtrl_2->TaskTime[ID].EndTime,7);//数据串比较(高位在低字节),p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
			if(i==2)
			{//p1<p2
				MR((u32)p8+15,(u32)&UARTCtrl_2->TaskTime[ID].EndTime,7);
			}
		}
//	}
#if (Project/100)==2//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
//	if(UARTCtrl_4->TaskTime[ID].Run)//任务执行状态:0=未执行,1=执行中,2=已执行,3=执行中暂停,4=执行未完成
//	{
		i=UARTCtrl_4->TaskTime[ID].EndTime[2];
		if((i!=0)&&(i!=0xff))
		{
			i=Compare_DL698DataString(p8+15,(u8 *)&UARTCtrl_4->TaskTime[ID].EndTime,7);//数据串比较(高位在低字节),p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
			if(i==2)
			{//p1<p2
				MR((u32)p8+15,(u32)&UARTCtrl_4->TaskTime[ID].EndTime,7);
			}
		}
//	}
#endif
#if (Project/100)==4//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
	if(Comm_Ram->MODE3in1==1)//三合一终端当前运行模式:0=专变,1=集中器
	{
//		if(UARTCtrl_4->TaskTime[ID].Run)//任务执行状态:0=未执行,1=执行中,2=已执行,3=执行中暂停,4=执行未完成
//		{
			i=UARTCtrl_4->TaskTime[ID].EndTime[2];
			if((i!=0)&&(i!=0xff))
			{
				i=Compare_DL698DataString(p8+15,(u8 *)&UARTCtrl_4->TaskTime[ID].EndTime,7);//数据串比较(高位在低字节),p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
				if(i==2)
				{//p1<p2
					MR((u32)p8+15,(u32)&UARTCtrl_4->TaskTime[ID].EndTime,7);
				}
			}
//		}
	}
#endif
//22 采集总数量         long-unsigned，
	p8[22]=DataType_long_unsigned;
//	p8[23]=0;
//	p8[24]=0;
	i=0;
//	if(UARTCtrl_1->TaskTime[ID].Run)//任务执行状态:0=未执行,1=执行中,2=已执行,3=执行中暂停,4=执行未完成
//	{
		i=UARTCtrl_1->NUMrmTOTAL[ID];
//	}
//	if(UARTCtrl_2->TaskTime[ID].Run)//任务执行状态:0=未执行,1=执行中,2=已执行,3=执行中暂停,4=执行未完成
//	{
		i+=UARTCtrl_2->NUMrmTOTAL[ID];
//	}
#if (Project/100)==2//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
//	if(UARTCtrl_4->TaskTime[ID].Run)//任务执行状态:0=未执行,1=执行中,2=已执行
//	{
		i+=UARTCtrl_4->NUMrmTOTAL[ID];
//	}
#endif
#if (Project/100)==4//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
	if(Comm_Ram->MODE3in1==1)//三合一终端当前运行模式:0=专变,1=集中器
	{
		if(UARTCtrl_4->TaskTime[ID].Run)//任务执行状态:0=未执行,1=执行中,2=已执行
		{
			i+=UARTCtrl_4->NUMrmTOTAL[ID];
		}
	}
#endif
	p8[23]=i>>8;
	p8[24]=i;
//25 采集成功数量       long-unsigned，
	p8[25]=DataType_long_unsigned;
//	p8[26]=0;
//	p8[27]=0;
	i=0;
	if(UARTCtrl_1->TaskTime[ID].Run)//任务执行状态:0=未执行,1=执行中,2=已执行,3=执行中暂停,4=执行未完成
	{
		SourTaskID=UARTCtrl_1->TaskID;
		TaskID=IDtoTaskID(ID);//入口:任务号id;出口：TaskID
		UARTCtrl_1->TaskID=TaskID;
		FileID=Get_FileID(RS485_1PORT);//UART各任务的FileID
		UARTCtrl_1->TaskID=SourTaskID;
		if((((FileID>>24)&0xf)==3)||(((TaskID>>20)&0xf)==4))
		{//原已采集完成数=0;抄曲线和补抄(日冻结和曲线)需抄多个点,在发送管理时识别各点是否已抄
			//UARTCtrl->NUMrmOK[id]=0;//原已采集完成数
			x=UARTCtrl_1->NUMrmOK[ID];
		}
		else
		{
			x=UARTCtrl_1->NUMrmOK[ID];
			y=UARTCtrl_1->NUMrmBAD[ID];
			if(x>=y)
			{
				x-=y;
			}
			else
			{
				x=0;
			}
		}
		i=x;
	}
	if(UARTCtrl_2->TaskTime[ID].Run)//任务执行状态:0=未执行,1=执行中,2=已执行,3=执行中暂停,4=执行未完成
	{
		SourTaskID=UARTCtrl_2->TaskID;
		TaskID=IDtoTaskID(ID);//入口:任务号id;出口：TaskID
		UARTCtrl_2->TaskID=TaskID;
		FileID=Get_FileID(RS485_2PORT);//UART各任务的FileID
		UARTCtrl_2->TaskID=SourTaskID;
		if((((FileID>>24)&0xf)==3)||(((TaskID>>20)&0xf)==4))
		{//原已采集完成数=0;抄曲线和补抄(日冻结和曲线)需抄多个点,在发送管理时识别各点是否已抄
			//UARTCtrl->NUMrmOK[id]=0;//原已采集完成数
			x=UARTCtrl_2->NUMrmOK[ID];
		}
		else
		{
			x=UARTCtrl_2->NUMrmOK[ID];
			y=UARTCtrl_2->NUMrmBAD[ID];
			if(x>=y)
			{
				x-=y;
			}
			else
			{
				x=0;
			}
		}
		i+=x;
	}
#if (Project/100)==2//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
	if(UARTCtrl_4->TaskTime[ID].Run)//任务执行状态:0=未执行,1=执行中,2=已执行,3=执行中暂停,4=执行未完成
	{
		SourTaskID=UARTCtrl_4->TaskID;
		TaskID=IDtoTaskID(ID);//入口:任务号id;出口：TaskID
		UARTCtrl_4->TaskID=TaskID;
		FileID=Get_FileID(RS485_4PORT);//UART各任务的FileID
		UARTCtrl_4->TaskID=SourTaskID;
		if((((FileID>>24)&0xf)==3)||(((TaskID>>20)&0xf)==4))
		{//原已采集完成数=0;抄曲线和补抄(日冻结和曲线)需抄多个点,在发送管理时识别各点是否已抄
			//UARTCtrl->NUMrmOK[id]=0;//原已采集完成数
			x=UARTCtrl_4->NUMrmOK[ID];
		}
		else
		{
			x=UARTCtrl_4->NUMrmOK[ID];
			y=UARTCtrl_4->NUMrmBAD[ID];
			if(x>=y)
			{
				x-=y;
			}
			else
			{
				x=0;
			}
		}
		i+=x;
	}
#endif
#if (Project/100)==4//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
	if(Comm_Ram->MODE3in1==1)//三合一终端当前运行模式:0=专变,1=集中器
	{
		if(UARTCtrl_4->TaskTime[ID].Run)//任务执行状态:0=未执行,1=执行中,2=已执行,3=执行中暂停,4=执行未完成
		{
			SourTaskID=UARTCtrl_4->TaskID;
			TaskID=IDtoTaskID(ID);//入口:任务号id;出口：TaskID
			UARTCtrl_4->TaskID=TaskID;
			FileID=Get_FileID(RS485_4PORT);//UART各任务的FileID
			UARTCtrl_4->TaskID=SourTaskID;
			if((((FileID>>24)&0xf)==3)||(((TaskID>>20)&0xf)==4))
			{//原已采集完成数=0;抄曲线和补抄(日冻结和曲线)需抄多个点,在发送管理时识别各点是否已抄
				//UARTCtrl->NUMrmOK[id]=0;//原已采集完成数
				x=UARTCtrl_4->NUMrmOK[ID];
			}
			else
			{
				x=UARTCtrl_4->NUMrmOK[ID];
				y=UARTCtrl_4->NUMrmBAD[ID];
				if(x>=y)
				{
					x-=y;
				}
				else
				{
					x=0;
				}
			}
			i+=x;
		}
	}
#endif
	p8[26]=i>>8;
	p8[27]=i;
	NUM_OK=i;
//28 已发送报文条数     long-unsigned，
	p8[28]=DataType_long_unsigned;
	i=p8[29]<<8;
	i|=p8[30];
	i+=NUM_Tx;
	if(i<NUM_OK)
	{//采集成功数不为0，而发送和接收帧数=0,在抄表成功后有代理等其他任务插入后TaskID=0，认为重新执行调用了采集任务监控初始化
		//准确条数=成功数*抄表命令数
		i=NUM_OK;//至少为成功数
	}
	p8[29]=i>>8;
	p8[30]=i;
//31 已接收报文条数     long-unsigned
	p8[31]=DataType_long_unsigned;
	i=p8[32]<<8;
	i|=p8[33];
	i+=NUM_Rx;
	if(i<NUM_OK)
	{//采集成功数不为0，而发送和接收帧数=0,在抄表成功后有代理等其他任务插入后TaskID=0，认为重新执行调用了采集任务监控初始化
		//准确条数=成功数*抄表命令数
		i=NUM_OK;//至少为成功数
	}
	p8[32]=i>>8;
	p8[33]=i;
}

void RM_Monitor_TxNUM(u32 ID,u32 NUM_Tx)//采集任务监控;入口:ID=任务号,NUM_Tx=发送条数
{
	u32 i;
	u8* p8;
	
	if(ID>=RMTASKmax)
	{
		return;
	}
	p8=(u8*)ADDR_6034+(ID*LENper_6034);
	i=p8[29]<<8;
	i|=p8[30];
	i+=NUM_Tx;
	p8[29]=i>>8;
	p8[30]=i;
}

void RM_Monitor_RxNUM(u32 ID,u32 NUM_Rx)//采集任务监控;入口:ID=任务号,NUM_Rx=接收条数
{
	u32 i;
	u8* p8;
	
	if(ID>=RMTASKmax)
	{
		return;
	}
	p8=(u8*)ADDR_6034+(ID*LENper_6034);
	i=p8[32]<<8;
	i|=p8[33];
	i+=NUM_Rx;
	p8[32]=i>>8;
	p8[33]=i;
}

void RM_State_SetUpDate(void)//采集状态,档案变更时更新(对应配置序号)
{
	u32 i;
	u32 x;
	u8* p8s;
	u8* p8d;

	p8s=(u8*)(ADDR_6000_SDRAM);
	p8d=(u8*)(ADDR_6032);
	for(i=0;i<NUM_RMmax;i++)
	{
		if(p8s[0])
		{
			if(p8d[0])
			{
				for(x=0;x<6;x++)
				{
					if(p8s[10+x]!=p8d[5+x])
					{
						break;
					}
				}
				if(x<6)
				{
					p8d[0]=0;//无效
				}
			}
		}
		else
		{
			p8d[0]=0;
		}
		p8s+=LENper_6000;
		p8d+=LENper_6032;
	}
}

void RM_State_RMUpDate(u32 PORTn,u32 OK,u32 SetNo,u32 Class,u32 Phase)//采集状态,每次抄表后更新:入口:OK=0失败=1成功,OK=1时Class=中继级别,Phase=相位
{
	u32 i;
	u32 offset;
#if ((USER/100)==9)//河南		
	u32 j;
	u8* p8s1;
#endif
	u8* p8d;

	p8d=(u8*)(ADDR_6032);
	p8d+=SetNo*LENper_6032;
	if(p8d[0]==0)
	{
		if(OK==0)
		{
			return;
		}
//一个采集状态∷=structure 
		p8d[0]=DataType_structure;
		p8d[1]=8;
//{ 
//1.通信地址              TSA， 
		p8d[2]=DataType_TSA;
		p8d[3]=7;
		p8d[4]=5;
		MR((u32)p8d+5,ADDR_6000_SDRAM+(SetNo*LENper_6000)+10,6);
		offset=11;
//2.中继级别              unsigned， 
		p8d[offset]=DataType_unsigned;
		p8d[offset+1]=Class;
		offset+=2;
//3.中继地址              TSA， 
		p8d[offset]=0;
		offset+=1;
//4.端口                  OAD， 
		p8d[offset]=DataType_OAD;
		i=PORTntoOAD(PORTn);//通信口号转为OAD值
		p8d[offset+1]=i>>24;
		p8d[offset+2]=(i>>16)&0xff;
		p8d[offset+3]=(i>>8)&0xff;
		p8d[offset+4]=i;
		offset+=5;
//5.最后一次采集成功时间  date_time_s， 
		p8d[offset]=DataType_date_time_s;
		Get_date_time_s(p8d+offset+1);//得到date_time_s共7字节
		offset+=8;
//6.采集失败次数          unsigned， 
		p8d[offset]=DataType_unsigned;
		p8d[offset+1]=0;
		offset+=2;
//7.相位 enum{未知（0），A 相（1），B 相（2），C 相（3）}，
		p8d[offset]=DataType_enum;
#if ((USER/100)==9)//河南	
		Data_Inverse((u32)p8d+5,6); // 转成比较参数
		p8s1=(u8*)ADDR_AFN10F31;
		for(j=0;j<NUM_RMmax;j++)
		{
			if(Compare_DL698DataString(p8s1 + 2 + 8 * j ,p8d+5, 6) == 0)
			{
				break;
			}
		}
		Data_Inverse((u32)p8d+5,6);	// 再次换转
		Phase = 0;
		if(j < NUM_RMmax)
		{
			if(p8s1[ 2+ 8*j + 6]&0x01)
			{
				Phase = 1;
			}
			
			if(p8s1[ 2+ 8*j + 6]&0x02)
			{
				Phase = 2;
			}
	
			if(p8s1[ 2+ 8*j + 6]&0x04)
			{
				Phase = 3;
			}
		}			
#endif
		p8d[offset+1]=Phase;
		offset+=2;
//8.相序异常 enum{正常（0），LN 互易（1），逆相序（2）} 
		p8d[offset]=DataType_enum;
		p8d[offset+1]=0;
//}
		return;
	}
	if(OK==0)
	{//失败
		//6.采集失败次数          unsigned， 
		p8d=Get_Element(p8d,6,0,0);//计算元素地址(虚拟地址指针),使用ADDR_128KDATABUFF;出口:地址指向元素的类型字节,0=错误
		if(p8d)
		{
			if(p8d[1]!=0xff)
			{
				p8d[1]++;
			}
		}
	}
	else
	{//成功
		//2.中继级别              unsigned， 
		p8d[12]=Class;
		//5.最后一次采集成功时间  date_time_s， 
		p8d=Get_Element(p8d,5,0,0);//计算元素地址(虚拟地址指针),使用ADDR_128KDATABUFF;出口:地址指向元素的类型字节,0=错误
		if(p8d)
		{
			Get_date_time_s(p8d+1);//得到date_time_s共7字节
			//7.相位 enum{未知（0），A 相（1），B 相（2），C 相（3）}，
			p8d+=10;
			p8d[1]=Phase;
		}
	}
}
/*
void RM_State_UpDate(u32 PORTn,u32 SetNo,u32 Phase,u32 Err)//采集状态更新:入口:SetNo=配置号,Phase=相位,Err=线路异常
{
	u32 i;
	u32 offset;
	u8* p8d;
	
