gdgly/NUC97X_JS/STM32F4xx/DL698/RM_TASK.cpp
	p8d=(u8*)(ADDR_6032);
	p8d+=SetNo*LENper_6032;
	if(p8d[0]==0)
	{
//一个采集状态∷=structure 
		p8d[0]=DataType_structure;
		p8d[1]=8;
//{ 
//1.通信地址              TSA， 
		p8d[2]=DataType_TSA;
		p8d[3]=7;
		p8d[4]=5;
		MR((u32)p8d+5,ADDR_6000_SDRAM+(SetNo*LENper_6000)+10,6);
		offset=11;
//2.中继级别              unsigned， 
		p8d[offset]=DataType_unsigned;
		p8d[offset+1]=0;
		offset+=2;
//3.中继地址              TSA， 
		p8d[offset]=0;
		offset+=1;
//4.端口                  OAD， 
		p8d[offset]=DataType_OAD;
		i=PORTntoOAD(PORTn);//通信口号转为OAD值
		p8d[offset+1]=i>>24;
		p8d[offset+2]=(i>>16)&0xff;
		p8d[offset+3]=(i>>8)&0xff;
		p8d[offset+4]=i;
		offset+=5;
//5.最后一次采集成功时间  date_time_s， 
		p8d[offset]=DataType_date_time_s;
		MC(0xff,(u32)p8d+offset+1,7);
		offset+=8;
//6.采集失败次数          unsigned， 
		p8d[offset]=DataType_unsigned;
		p8d[offset+1]=0;
		offset+=2;
//7.相位 enum{未知（0），A 相（1），B 相（2），C 相（3）}，
		p8d[offset]=DataType_enum;
		p8d[offset+1]=Phase;
		offset+=2;
//8.相序异常 enum{正常（0），LN 互易（1），逆相序（2）} 
		p8d[offset]=DataType_enum;
		p8d[offset+1]=Err;
//}
		return;
	}
//7.相位 enum{未知（0），A 相（1），B 相（2），C 相（3）}，
	p8d=Get_Element(p8d,7,0,0);//计算元素地址(虚拟地址指针),使用ADDR_128KDATABUFF;出口:地址指向元素的类型字节,0=错误
	if(p8d)
	{
		p8d[1]=Phase;
//8.相序异常 enum{正常（0），LN 互易（1），逆相序（2）} 
		p8d[3]=Err;
	}
}

void RM_State_ReadRouterAllUpDate(u32 PORTn)//采集状态,读全部路由信息更新
{
	u32 i;
	u32 n;
	u32 StartNo;
	u32 SetNo;
	u32 Phase;
	u32 Err;
	u32 NUMmax;
	u8* p8;
	
	StartNo=0;//开始序号
	while(1)
	{
		UART_3762_AFN03F101(PORTn,StartNo,15,(u8*)ADDR_128KDATABUFF);//(河南)查询节点台区信息(只暂停路由,没恢复);入口:StartNo=节点起始序号首帧从0开始,Num=节点数量(最大支持15个),p8Buff=数据放置缓冲
//台区节点总数量	BIN	2
//本次上报节点数量n(n<=15)	BIN	1
//节点1地址	BCD	6
//b7	b6	b5-3	b2-1	b0	BS	1
//保留	线路异常	相序	台区状态	表档案		
//节点1台区地址	BCD	6
//…
		p8=(u8*)ADDR_128KDATABUFF;
		NUMmax=p8[0]|(p8[1]<<8);//台区节点总数量
		n=p8[2];//本次上报节点数量
		p8+=3;
		for(i=0;i<n;i++)
		{
			MR(ADDR_DATABUFF,(u32)p8,6);
			Data_Inverse(ADDR_DATABUFF,6);//数据倒序(高低字节调换),入口Le>=2
			StartNo=AddrToMeterSetNo((u16*)ADDR_DATABUFF);//搜索通信地址在采集档案配置表中的序号;返回:从0开始的配置序号,>=NUM_RMmax表示无效
			if(StartNo<NUM_RMmax)
			{//找到序号
				Phase=p8[6];
				Err=Phase;
				Phase>>=3;
				Phase&=0x03;
				switch(Phase)
				{
					case 1:
						Phase=1;//相位 enum{未知（0），A 相（1），B 相（2），C 相（3）}
						break;
					case 2:
						Phase=2;
						break;
					case 4:
						Phase=3;
						break;
					default:
						Phase=0;
						break;
				}
				Err>>=6;//相序异常 enum{正常（0），LN 互易（1），逆相序（2）} 
				Err&=1;
				if(Err)
				{
					Err=2;//相序异常 enum{正常（0），LN 互易（1），逆相序（2）} 
				}
				RM_State_UpDate(RS485_4PORT,SetNo,Phase,Err);//采集状态更新:入口:SetNo=配置号,Phase=相位,Err=线路异常
			}
			p8+=13;
		}
		StartNo+=n;
		if(StartNo>=NUMmax)
		{
			break;
		}
	}
}
*/


u32 DateSaveTI(u32 PORTn,u8* pOUT)//普通采集方案的采集存储时标;返回:时标类型1=任务开始时间,2=相对当日0点0分,3=...,6=;pOUT=date_time_s
{
	u32 i;
	u32 x;
	u32 id;
	u32 YYMD;
	u8* p8;
	UARTCtrl_TypeDef *UARTCtrl;
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
//b31-b28优先级:1=首要,2=必要,3=需要,4=可能
//b27-b24方案类型:1=普通采集方案,2=事件采集方案,3=透明方案,4=上报方案,5=脚本方案
//b23-b20普通采集方案的采集类型:0=采集当前数据,1=采集上第N次,2=按冻结时标采集,3=按时标间隔采集
//b19-b16普通采集方案的存储时标:0=未定义,1=任务开始时间,2=相对当日0点0分,3=相对上日23点59分,4=相对上日0点0分,5=相对当月1日0点0分,6=数据冻结时标
	id=UARTCtrl->TaskID;//当前采集任务ID;值0表示无采集任务;b31-b28优先级,b27-b24方案类型,b23-b20采集类型,b19-b16存储时标类型,b15-b8任务号,b7-b0方案编号
	switch((id>>16)&0xf)//普通采集方案的存储时标
	{
		default://(使用任务开始时间,抄表失败地址存储时需要存储时标)
		case 0://未定义(使用任务开始时间)
		case 1://任务开始时间
			if(pOUT)
			{
				i=id;
				i>>=20;
				i&=0xf;
				switch(i)//普通采集方案的采集类型
				{
					default:
					//case 0://采集当前数据,
					//case 1://采集上第N次,
					//case 2://按冻结时标采集,
					//case 3://按时标间隔采集
						id>>=8;
						id&=0xff;//任务号
						if(id<(RMTASKmax+ExtRMTASKmax))
						{
							for(i=0;i<7;i++)
							{
								pOUT[i]=UARTCtrl->TaskTime[id].StdTime[i];
							}
						}
						break;
					case 4://RetryMetering 补抄
						id>>=8;
						id&=0xff;//任务号
						YYMD=(UARTCtrl->TaskTime[id].StdTime[0]<<24)+(UARTCtrl->TaskTime[id].StdTime[1]<<16)+(UARTCtrl->TaskTime[id].StdTime[2]<<8)+UARTCtrl->TaskTime[id].StdTime[3];
						i=UARTCtrl->RM_DI_TI_Count;//按时标间隔采集时的间隔计数
						while(i--)
						{
							YYMD=YYMD_Sub1D_hex(YYMD);//年年月日减1日,返回减1后的年年月日
						}
						pOUT[0]=YYMD>>24;
						pOUT[1]=YYMD>>16;
						pOUT[2]=YYMD>>8;
						pOUT[3]=YYMD;
						pOUT[4]=0;
						pOUT[5]=0;
						pOUT[6]=0;
						break;
				}
			}
			return 1;
		case 2://相对当日0点0分
			i=(id>>8)&0xff;//任务号
			i=MRR(ADDR_6012_2_SDRAM+(i*LENper_6012_2)+5,3);
			YYMD=(i&0xff00)+(i>>16);
			i&=0xff;
			switch(i)//采集频率
			{
				case 0://秒      （0），
					break;
				case 1://分      （1），
					YYMD*=60;
					break;
				case 2://时      （2），
					YYMD*=60*60;
					break;
				case 3://日      （3），
					YYMD*=60*60*24;
				case 4://月      （4），
				case 5://年      （5）
				default:
					YYMD*=60*60*24;
					break;
			}
#if((USER/100)==0||(USER/100)==15)//电科院测试
			if(YYMD<(60*60*24))
			{
				//采集间隔小于1日,存储时标用任务开始时间(注:电科院测试软件采集事件等监控数据用相对当日0点0分）
				if(pOUT)
				{
					id=(UARTCtrl->TaskID>>8)&0xff;
					if(id<(RMTASKmax+ExtRMTASKmax))
					{
						for(i=0;i<7;i++)
						{
							pOUT[i]=UARTCtrl->TaskTime[id].StartTime[i];
						}
					}
				}
				return 1;
			}
#endif
			if(pOUT)
			{
				i=UARTCtrl->TaskID;
				i>>=20;
				i&=0xf;
				switch(i)//普通采集方案的采集类型
				{
					default:
					//case 0://采集当前数据,
					//case 1://采集上第N次,
					//case 2://按冻结时标采集,
					//case 3://按时标间隔采集
						for(i=0;i<4;i++)
						{
							pOUT[i]=Comm_Ram->DL698YMDHMS[i];
						}
						pOUT[4]=0;
						pOUT[5]=0;
						pOUT[6]=0;
						break;
					case 4://RetryMetering 补抄
						YYMD=(Comm_Ram->DL698YMDHMS[0]<<24)+(Comm_Ram->DL698YMDHMS[1]<<16)+(Comm_Ram->DL698YMDHMS[2]<<8)+Comm_Ram->DL698YMDHMS[3];
						i=UARTCtrl->RM_DI_TI_Count;//按时标间隔采集时的间隔计数
						while(i--)
						{
							YYMD=YYMD_Sub1D_hex(YYMD);//年年月日减1日,返回减1后的年年月日
						}
						pOUT[0]=YYMD>>24;
						pOUT[1]=YYMD>>16;
						pOUT[2]=YYMD>>8;
						pOUT[3]=YYMD;
						pOUT[4]=0;
						pOUT[5]=0;
						pOUT[6]=0;
						break;
				}
			}
			return 2;
		case 3://相对上日23点59分
			if(pOUT)
			{
				YYMD=(Comm_Ram->DL698YMDHMS[0]<<24)+(Comm_Ram->DL698YMDHMS[1]<<16)+(Comm_Ram->DL698YMDHMS[2]<<8)+Comm_Ram->DL698YMDHMS[3];
				i=UARTCtrl->TaskID;
				i>>=20;
				i&=0xf;
				switch(i)//普通采集方案的采集类型
				{
					default:
					//case 0://采集当前数据,
					//case 1://采集上第N次,
					//case 2://按冻结时标采集,
					//case 3://按时标间隔采集
						YYMD=YYMD_Sub1D_hex(YYMD);//年年月日减1日,返回减1后的年年月日
						break;
					case 4://RetryMetering 补抄
						YYMD=YYMD_Sub1D_hex(YYMD);//年年月日减1日,返回减1后的年年月日
						i=UARTCtrl->RM_DI_TI_Count;//按时标间隔采集时的间隔计数
						while(i--)
						{
							YYMD=YYMD_Sub1D_hex(YYMD);//年年月日减1日,返回减1后的年年月日
						}
						break;
				}
				pOUT[0]=YYMD>>24;
				pOUT[1]=YYMD>>16;
				pOUT[2]=YYMD>>8;
				pOUT[3]=YYMD>>0;
				pOUT[4]=23;
				pOUT[5]=59;
				pOUT[6]=0;
			}
			return 3;
		case 4://相对上日0点0分
			if(pOUT)
			{
				YYMD=(Comm_Ram->DL698YMDHMS[0]<<24)+(Comm_Ram->DL698YMDHMS[1]<<16)+(Comm_Ram->DL698YMDHMS[2]<<8)+Comm_Ram->DL698YMDHMS[3];
				i=UARTCtrl->TaskID;
				i>>=20;
				i&=0xf;
				switch(i)//普通采集方案的采集类型
				{
					default:
					//case 0://采集当前数据,
					//case 1://采集上第N次,
					//case 2://按冻结时标采集,
					//case 3://按时标间隔采集
						YYMD=YYMD_Sub1D_hex(YYMD);//年年月日减1日,返回减1后的年年月日
						break;
					case 4://RetryMetering 补抄
						YYMD=YYMD_Sub1D_hex(YYMD);//年年月日减1日,返回减1后的年年月日
						i=UARTCtrl->RM_DI_TI_Count;//按时标间隔采集时的间隔计数
						while(i--)
						{
							YYMD=YYMD_Sub1D_hex(YYMD);//年年月日减1日,返回减1后的年年月日
						}
						break;
				}
				pOUT[0]=YYMD>>24;
				pOUT[1]=YYMD>>16;
				pOUT[2]=YYMD>>8;
				pOUT[3]=YYMD>>0;
				pOUT[4]=0;
				pOUT[5]=0;
				pOUT[6]=0;
			}
			return 4;
		case 5://相对当月1日0点0分
			if(pOUT)
			{
				for(i=0;i<3;i++)
				{
					pOUT[i]=Comm_Ram->DL698YMDHMS[i];
				}
				pOUT[3]=1;
				pOUT[4]=0;
				pOUT[5]=0;
				pOUT[6]=0;
			}
			return 5;
		case 6://数据冻结时标
//b31-b28优先级:1=首要,2=必要,3=需要,4=可能
//b27-b24方案类型:1=普通采集方案,2=事件采集方案,3=透明方案,4=上报方案,5=脚本方案
//b23-b20普通采集方案的采集类型:0=采集当前数据,1=采集上第N次,2=按冻结时标采集,3=按时标间隔采集
//b19-b16普通采集方案的存储时标:0=未定义,1=任务开始时间,2=相对当日0点0分,3=相对上日23点59分,4=相对上日0点0分,5=相对当月1日0点0分,6=数据冻结时标
//b15-b8任务号
//b7-b0方案编号
			if(pOUT)
			{
				i=UARTCtrl->TaskID&0xff;//方案号
				p8=(u8*)(u8*)ADDR_6014_SDRAM+(i*LENper_6014);
				p8=Get_Element(p8,4,1,0);//计算元素地址,使用ADDR_128KDATABUFF
				i=0;
				if(p8)
				{
					i=(p8[0]<<24)|(p8[1]<<16)|(p8[2]<<8)|p8[3];
				}
				//i=(UARTCtrl->RMCSD[2]<<8)|(UARTCtrl->RMCSD[3]<<0);//采集数据的OI
				switch(i)
				{
					case 0x5B015002://分钟冻结(采曲线数据)
						i=UARTCtrl->TaskID;
						i>>=20;
						i&=0xf;
						switch(i)//普通采集方案的采集类型
						{
							default:
							case 0://采集当前数据,
								id>>=8;
								id&=0xff;//任务号
								if(id<(RMTASKmax+ExtRMTASKmax))
								{
									for(i=0;i<7;i++)
									{
										pOUT[i]=UARTCtrl->TaskTime[id].StdTime[i];//用任务开始标准时间
									}
								}
								break;
							case 1://采集上第N次,
								//上1次到上10次
								id>>=8;
								id&=0xff;//任务号
								if(id>=(RMTASKmax+ExtRMTASKmax))
								{
									break;
								}
								for(i=0;i<7;i++)
								{
									pOUT[i]=UARTCtrl->TaskTime[id].StdTime[i];//任务开始标准时间
								}
								p8=(u8*)ADDR_6012_2_SDRAM+(id*LENper_6012_2);
								x=(p8[6]<<8)+p8[7];//取频率值
								if(x==0)
								{
									x=1;//最小值=1
								}
								switch(p8[5])//执行频率   TI
								{
									case 0://秒      （0），
										break;
									case 1://分      （1），
										x*=60;
										break;
									case 2://时      （2），
										x*=60*60;
										break;
									case 3://日      （3），
										x*=60*60*24;
										break;
									case 4://月      （4），
									case 5://年      （5）
										x*=60*60*24*31;
										break;
								}
								i=UARTCtrl->RM_DI_N;//采集上第N次
								if(i)
								{
									i--;
								}
								x*=i;
								pYYMDHMS_SubS_hex(pOUT,x);//年年月日时分秒减S秒,返回减S秒后的年年月日时分秒
								break;
							case 2://按冻结时标采集,
								id>>=8;
								id&=0xff;//任务号
								if(id<(RMTASKmax+ExtRMTASKmax))
								{
									for(i=0;i<7;i++)
									{
										pOUT[i]=UARTCtrl->TaskTime[id].StdTime[i];//用任务开始标准时间
									}
								}
								break;
							case 3://按时标间隔采集
								id>>=8;
								id&=0xff;//任务号
								if(id>=(RMTASKmax+ExtRMTASKmax))
								{
									break;
								}
							#if (USER/100)==9//河南,5分钟电压曲线
								if(PORTn==ACSAMPLEPORT)
								{//交采曲线
									MR((u32)pOUT,(u32)&UARTCtrl->TaskTime[id].StdTime,7);
									return 6;
								}
							#endif
								switch(UARTCtrl->RMprotocol)//抄表规约类型=未知 (0)，DL/T645-1997（1），DL/T645-2007（2），DL/T698.45（3），CJ/T 188-2004（4）
								{
									case 1://DL/T645-1997（1）
										//总是用实时数据代，用标准任务开始时间
										MR((u32)pOUT,(u32)&UARTCtrl->TaskTime[id].StdTime,7);
										return 6;
									case 2://DL/T645-2007（2）
										switch(UARTCtrl->RM_DI)
										{
											case 0x06000001://全部6类负荷曲线
											case 0x06010001://1类负荷曲线(电压、电流、频率)
											case 0x06020001://2类负荷曲线(有无功功率)
											case 0x06030001://3类负荷曲线(功率因数)
											case 0x06040001://4类负荷曲线(正反有功,組合无功1和2总电能)
											case 0x06050001://5类负荷曲线(1-4象限无功总电能)
											case 0x06060001://6类负荷曲线(当前有功需量,当前无功需量)
												break;
											default:
												//是用实时数据代，用标准任务开始时间
												MR((u32)pOUT,(u32)&UARTCtrl->TaskTime[id].StdTime,7);
												return 6;
										}
										break;
									case 3://DL/T698.45（3）
										break;
									case ProtocolNO_ABB://ABB表通信协议编号
									case ProtocolNO_Landis://Landis表通信协议编号(IEC1107 模式C)
										//总是用实时数据代，用标准任务开始时间
										MR((u32)pOUT,(u32)&UARTCtrl->TaskTime[id].StdTime,7);
										return 6;
									default:
										break;
								}
								//按任务执行间隔时间和采集方案采集间隔时间计算
								//任务执行间隔时间
								p8=(u8*)ADDR_6012_2_SDRAM+(id*LENper_6012_2);
								i=pTItoSECOND(p8+5);//TI转为秒值,入口:pTI无数据类型;出口:hex秒
								if(PORTn==RS485_4PORT)
								{//是载波口
								#if (CurveTaskTImax)
									if(i<CurveTaskTImax)//(6*60*60)//曲线抄表任务执行频率最大值(秒),此值决定按采集方案采集间隔时间可向前补抄的曲线点数
									{
										i=CurveTaskTImax;
									}
								#endif
								}
								//采集方案采集间隔时间
								x=pTItoSECOND(UARTCtrl->RM_DI_TI);//TI转为秒值,入口:pTI无数据类型;出口:hex秒
								
