gdgly/NUC97X_JS/STM32F4xx/DL698/RM_TASK.cpp
								//#if (USER/100)==17
								//if(UARTCtrl->RM_DI_TI_Count==0)
								//{
									//UARTCtrl->RM_DI_TI_Count=1;
								//}
								//x*=(UARTCtrl->RM_DI_TI_Count-1);
								//#else
								//x*=UARTCtrl->RM_DI_TI_Count;
								//#endif
								x*=UARTCtrl->RM_DI_TI_Count;
								if(i>=x)
								{
									i-=x;
								}
								else
								{
									i=0;
								}
								MR((u32)pOUT,(u32)&UARTCtrl->TaskTime[id].StdTime,7);
								pYYMDHMS_SubS_hex(pOUT,i);//年年月日时分秒减S秒,返回减S秒后的年年月日时分秒
								break;
							case 4://RetryMetering 补抄
								id>>=8;
								id&=0xff;//任务号
								if(id>=(RMTASKmax+ExtRMTASKmax))
								{
									break;
								}
								MR((u32)pOUT,(u32)&UARTCtrl->TaskTime[id].StdTime,7);
								i=pTItoSECOND(UARTCtrl->RM_DI_TI);//TI转为秒值,入口:pTI无数据类型;出口:hex秒
								//#if (USER/100)==17
								//if(UARTCtrl->RM_DI_TI_Count==0)
								//{
									//UARTCtrl->RM_DI_TI_Count=1;
								//}
								//i*=(UARTCtrl->RM_DI_TI_Count-1);
								//#else
								//i*=UARTCtrl->RM_DI_TI_Count;
								//#endif
								i*=UARTCtrl->RM_DI_TI_Count;
								pYYMDHMS_SubS_hex(pOUT,i);//年年月日时分秒减S秒,返回减S秒后的年年月日时分秒
								return 6;
						}
						break;
					case  0x5B015004://日冻结
						i=id;
						i>>=20;
						i&=0xf;
						switch(i)//普通采集方案的采集类型
						{
							default:
							case 0://采集当前数据,
							case 1://采集上第N次,
							case 2://按冻结时标采集,
							case 3://按时标间隔采集
								for(i=0;i<4;i++)
								{
									pOUT[i]=Comm_Ram->DL698YMDHMS[i];
								}
								pOUT[4]=0;
								pOUT[5]=0;
								pOUT[6]=0;
								break;
							case 4://RetryMetering 补抄
								YYMD=(Comm_Ram->DL698YMDHMS[0]<<24)+(Comm_Ram->DL698YMDHMS[1]<<16)+(Comm_Ram->DL698YMDHMS[2]<<8)+Comm_Ram->DL698YMDHMS[3];
								i=UARTCtrl->RM_DI_TI_Count;//按时标间隔采集时的间隔计数
								while(i--)
								{
									YYMD=YYMD_Sub1D_hex(YYMD);//年年月日减1日,返回减1后的年年月日
								}
								pOUT[0]=YYMD>>24;
								pOUT[1]=YYMD>>16;
								pOUT[2]=YYMD>>8;
								pOUT[3]=YYMD;
								pOUT[4]=0;
								pOUT[5]=0;
								pOUT[6]=0;
								break;
						}
						break;
					case 0x5B015006://月冻结
						for(i=0;i<4;i++)
						{
							pOUT[i]=Comm_Ram->DL698YMDHMS[i];
						}
						pOUT[3]=0x01;//固定为1日
						pOUT[4]=0;
						pOUT[5]=0;
						pOUT[6]=0;
						break;
					default:
						for(i=0;i<4;i++)
						{
							pOUT[i]=Comm_Ram->DL698YMDHMS[i];
						}
						pOUT[4]=0;
						pOUT[5]=0;
						pOUT[6]=0;
						id=UARTCtrl->TaskID;
						id>>=8;
						id&=0xff;//任务号
						p8=(u8*)ADDR_6012_2_SDRAM+(id*LENper_6012_2);
						switch(p8[5])//执行频率   TI
						{
							case 0://秒      （0），
								break;
							case 1://分      （1），
								break;
							case 2://时      （2），
								pOUT[4]=Comm_Ram->DL698YMDHMS[4];//时
								break;
							case 3://日      （3），
								break;
							case 4://月      （4），
								pOUT[3]=0x01;//固定为1日
								break;
							case 5://年      （5）
								break;
						}
						break;
				}
			}
			return 6;
		case 7://相对上月月末23点59分
			if(pOUT)
			{
				YYMD=(Comm_Ram->DL698YMDHMS[0]<<16)+(Comm_Ram->DL698YMDHMS[1]<<8)+(Comm_Ram->DL698YMDHMS[2]<<0);
				YYMD=YYM_SubM_hex(YYMD,1);//年年月减m月,返回减m月后的年年月
				pOUT[0]=YYMD>>16;
				pOUT[1]=YYMD>>8;
				pOUT[2]=YYMD>>0;
				YYMD=YYM_D_hex(YYMD);//取指定年月的天数
				pOUT[3]=YYMD;
				pOUT[4]=23;
				pOUT[5]=59;
				pOUT[6]=0;
			}
			return 7;
	}
}

void RM_UpDate(void)//抄表参数更新;出口:判断,读采集档案配置表从flash到sdram,置位各PORTn各任务需重计算总需抄表数成功数等
{
	u32 i;
	u32 x;
	u32 n;
	u32 m;
	u32 PORTs;
	u32 PORTd;
	u32 UpDate;
	u8* p8s;
	u8* p8d;
	UARTCtrl_TypeDef *UARTCtrl;
	
	if(Terminal_Ram->SET6000==0x55)//采集档案配置表有设置标志:0=没设置,0x55=设置
	{
		Terminal_Ram->SET6000=0;//采集档案配置表有设置标志:0=没设置,0x55=设置
		UpDate=0;//变化标志
		n=0;
		while(n<NUMmax_6000)
		{
			m=LEN_128KDATABUFF/LENper_6000;
			if(m>(NUMmax_6000-n))
			{
				m=NUMmax_6000-n;
			}
			MR(ADDR_128KDATABUFF,ADDR_6000,m*LENper_6000);
			for(i=0;i<m;i++)
			{
				//删除
				p8s=(u8*)ADDR_128KDATABUFF+(i*LENper_6000);
				p8d=(u8*)ADDR_6000_SDRAM+((n+i)*LENper_6000);
				if(p8s[0]!=p8d[0])
				{
					break;
				}
				//地址
				p8s+=8;
				p8d+=8;
				//x=Compare_octet_string(p8s,p8d);//比较字节串,p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
				Compare_TSA_string(p8s,p8d);//比较TSA串,p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
				if(x)
				{
					break;
				}
				//端口
				x=p8s[0];
				x++;
				x+=5;
				p8s+=x;
				p8d+=x;
				PORTs=(p8s[0]<<24)|(p8s[1]<<16)|(p8s[2]<<8)|p8s[3];
				PORTd=(p8d[0]<<24)|(p8d[1]<<16)|(p8d[2]<<8)|p8d[3];
				if(PORTs!=PORTd)
				{
					//0xF2090201://RS485_4通信口号(集中器载波,专变控制模块)
					break;
				}
			}
			if(i<m)
			{
				UpDate=1;//变化标志
				break;
			}
			n+=m;
		}
		if(UpDate)//变化标志
		{
			MR(ADDR_6000_SDRAM,ADDR_6000,LENmax_6000);
			Terminal_Ram->SETTask=0xff;//任务配置表采集方案有设置标志:0=没设置,0xff=设置
			UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(RS485_4PORT);
			UARTCtrl->SetChange6000=0x55;//采集档案配置表有变化标志:0=没变化,0x55=变化
			Terminal_Ram->RouterSynDelay_S_Timer=10;//路由档案同步延时执行秒定时器
			RM_State_SetUpDate();//采集状态,档案变更时更新(对应配置序号)
			
		}
		return;
	}
	if(Terminal_Ram->FLASHtoSDRAM!=Comm_Ram->DL698YMDHMS[4])//参数FLASHtoSDRAM上次进行的实时钟时(或其他)
	{
		Terminal_Ram->FLASHtoSDRAM=Comm_Ram->DL698YMDHMS[4];//参数FLASHtoSDRAM上次进行的实时钟时(或其他)
		FLASHtoSDRAM();//参数FLASHtoSDRAM
	}
}








